Repository: Kr0mAgn0n/gnome-devel-docs
Catalog: integration-guide/*/*.po
Languages: de

source: That is, each MIME type requires two GConf keys (<literal>enable</literal> and <literal>command</literal>) under the same path. The path name can be derived from the MIME type name by substituting a "<literal>/</literal>" with "<literal>@</literal>". For example, a thumbnailer for <literal>image/x-my-format</literal> would need two keys: <literal>/desktop/gnome/thumbnailers/image@x-my-format/enable</literal> and <literal>/desktop/gnome/thumbnailers/image@x-my-format/command</literal>.
de: Jeder MIME-Typ benötigt zwei Schlüssel (<literal>enable</literal> und <literal>command</literal>) im gleichen Pfad. Der Pfadname kann aus dem MIME-Typ selbst durch Ersetzung von »<literal>/</literal>« durch »<literal>@</literal>« erstellt werden. Beispielsweise benötigt ein Thumbnailer für <literal>image/x-my-format</literal> zwei Schlüssel: <literal>/desktop/gnome/thumbnailers/image@x-my-format/enable</literal> und <literal>/desktop/gnome/thumbnailers/image@x-my-format/command</literal>.

source: Within the <literal>command</literal> key, GNOME will look for percent sequences and substitute them with actual values:
de: Im Schlüssel <literal>command</literal> sucht GNOME nach Prozentzeichen und ersetzt diese durch die aktuellen Werte.

source: Input file name. This is the file that your thumbnailer needs to read.
de: Name der Eingabedatei. Dies ist die Datei, die durch den Thumbnailer gelesen wird.

source: Input URI. If your thumbnailer can handle URIs instead of plain file names, use <literal>%u</literal> instead of <literal>%i</literal>.
de: Eingabeadresse. Falls Ihr Thumbnailer mit Adressen anstelle von gewöhnlichen Dateinamen umgehen kann, verwenden Sie <literal>%u</literal> anstelle von <literal>%i</literal>.

source: Output file name. This is where your thumbnailer should write the thumbnail image in PNG format.
de: Name der Ausgabedatei. In diese Datei schreibt der Thumbnailer das Vorschaubild im PNG-Format.

source: Size of the thumbnail as a single integer. For example, if this gets substituted with <literal>128</literal>, it means that your thumbnailer should output an image no bigger than 128×128 pixels.
de: Größe des Vorschaubildes als einzelner Integer. Wenn dies beispielsweise durch <literal>128</literal> ersetzt wird, dann gibt der Thumbnailer ein Bild aus, das nicht größer als 128x128 Pixel ist.

source: Either of <literal>%i</literal> and <literal>%u</literal> must appear in your command, and <literal>%o</literal> is also mandatory. The <literal>%s</literal> substitution is optional, but we recommend that your thumbnailer pay attention to it.
de: Entweder <literal>%i</literal> oder <literal>%u</literal> müssen in Ihrem Befehl erscheinen, und <literal>%o</literal> ist ebenfalls obligatorisch. Die <literal>%s</literal>-Ersetzung ist optional, aber wir empfehlen, dass Ihr Thumbnailer auch dies berücksichtigen sollte.

source: Additional information
de: Zusätzliche Information

source: As an additional configuration parameter, you can turn on the boolean key <literal>/desktop/gnome/thumbnailers/disable_all</literal> to disable the generation of all thumbnails.
de: Als weiteren Konfigurationsparameter können Sie den Boole'schen Schlüssel <literal>/desktop/gnome/thumbnailers/disable_all</literal> einschalten, um die Erzeugung aller Vorschaubilder zu deaktivieren.

source: Integration Checklist
de: Integrations-Checkliste

source: This appendix provides a checklist of the various tasks presented through this guide. You can use the checklist to ensure that your software is integrated into GNOME in at least the most basic ways, and also as a resource to plan for further integration work.
de: Dieser Anhang stellt eine Checkliste für die verschiedenen Aufgaben bereit, die in diesem Handbuch behandelt werden. Sie können mit dieser Checkliste sicherstellen, dass Ihre Software zumindest grundlegend in GNOME integriert ist. Außerdem ist diese Liste als Ressource für die Planung weiterer Integrationsaufgaben verwendbar.

source: Does your application appear in the menus of the GNOME Panel?
de: Erscheint Ihre Anwendung in den Menüs des GNOME-Panels?

source: Does your application have an icon for the panel menus or the desktop? If so, does it have multiple pre-rendered sizes and a scalable <acronym>SVG</acronym> version?
de: Hat Ihre Anwendung ein Symbol für die Panel-Menüs oder den Desktop? Falls ja, stehen die Symbole in verschiedenen Größen und auch eine skalierbare <acronym>SVG</acronym>-Version bereit?

source: If your application can load or save files, does it register the MIME types that it can handle?
de: Falls Ihre Anwendung Dateien öffnen oder speichern kann, werden die MIME-Typen registriert, mit denen sie umgehen kann?

source: Does your application provide MIME icons for the file manager?
de: Stellt Ihre Anwendung MIME-Symbole für den Dateimanager bereit?

source: Does your application support startup notification, so that GNOME can display feedback to the user while your application is being launched?
de: Unterstützt Ihre Anwendung Benachrichtigungen beim Start, so dass GNOME Rückmeldungen an den Benutzer anzeigen kann, wenn die Anwendung geladen wird?

source: If your application creates "printable" documents, does it install a thumbnailer for use by the file manager?
de: Falls Ihre Anwendung »druckbare« Dokumente erzeugt, wird dann ein Vorschaubild für die Verwendung im Dateimanager installiert?

source: Acknowledgments
de: Danksagungen

source: Many thanks to Jakub Steiner for providing a beautiful CSS stylesheet for the HTML version of this guide!
de: Vielen Dank an Jakub Steiner für die Bereitstellung einer schönen CSS-Stilvorlage für die HTML-Version dieses Handbuchs!
