Repository: Kr0mAgn0n/gnome-devel-docs
Catalog: integration-guide/*/*.po
Languages: de

# _
source: translator-credits
de: Mario Blättermann <mario.blaettermann@gmail.com>, 2009, 2012, 2013 Christian Kirbach <christian.kirbach@gmail.com>, 2013.

source: Integrating existing software with GNOME
de: Integration vorhandener Software in GNOME

source: Guide for Independent Software Vendors
de: Handbuch für unabhängige Software-Anbieter

source: Extended the icon guidelines.
de: Erweiterung der Symbol-Empfehlungen.

source: <revnumber>0.6</revnumber> <date>2006/September/19</date> <_:revdescription-1/>
de: <revnumber>0.6</revnumber> <date>19. September 2006</date> <_:revdescription-1/>

source: Integrated the content of Rosanna Yuen's first article on freedesktop.org standards.
de: Einfügen des Inhalts von Rosanna Yuens erstem Artikel über die Freedesktop.org-Standards.

source: <revnumber>0.5</revnumber> <date>2006/September/18</date> <_:revdescription-1/>
de: <revnumber>0.5</revnumber> <date>18. September 2006</date> <_:revdescription-1/>

source: Initial version of this document.
de: Erste Version dieses Dokuments.

source: <revnumber>0.0</revnumber> <date>June 2005</date> <_:revdescription-1/>
de: <revnumber>0.0</revnumber> <date>Juni 2005</date> <_:revdescription-1/>

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License (GFDL), Version 1.1 or any later version published by the Free Software Foundation with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. You can find a copy of the GFDL at this <ulink url="ghelp:fdl">link</ulink> or in the file COPYING-DOCS distributed with this manual.
de: Das vorliegende Dokument kann gemäß den Bedingungen der GNU Free Documentation License (GFDL), Version 1.1 oder jeder späteren, von der Free Software Foundation veröffentlichten Version ohne unveränderbare Abschnitte sowie ohne Texte auf dem vorderen und hinteren Buchdeckel kopiert, verteilt und/oder modifiziert werden. Eine Kopie der GFDL finden Sie unter diesem <ulink type="help" url="ghelp:fdl">Link</ulink> oder in der mit diesem Handbuch gelieferten Datei COPYING-DOCS.

source: This manual is part of a collection of GNOME manuals distributed under the GFDL. If you want to distribute this manual separately from the collection, you can do so by adding a copy of the license to the manual, as described in section 6 of the license.
de: Dieses Handbuch ist Teil einer Sammlung von GNOME-Handbüchern, die unter der GFDL veröffentlicht werden. Wenn Sie dieses Handbuch getrennt von der Sammlung weiterverbreiten möchten, können Sie das tun, indem Sie eine Kopie der Lizenz zum Handbuch hinzufügen, wie es in Abschnitt 6 der Lizenz beschrieben ist.

source: Many of the names used by companies to distinguish their products and services are claimed as trademarks. Where those names appear in any GNOME documentation, and the members of the GNOME Documentation Project are made aware of those trademarks, then the names are in capital letters or initial capital letters.
de: Viele der Namen, die von Unternehmen verwendet werden, um ihre Produkte und Dienstleistungen von anderen zu unterscheiden, sind eingetragene Warenzeichen. An den Stellen, an denen diese Namen in einer GNOME-Dokumentation erscheinen, werden die Namen in Großbuchstaben oder mit einem großen Anfangsbuchstaben geschrieben, wenn das GNOME-Dokumentationsprojekt auf diese Warenzeichen hingewiesen wird.

source: DOCUMENT IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS FREE OF DEFECTS MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY, ACCURACY, AND PERFORMANCE OF THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS WITH YOU. SHOULD ANY DOCUMENT OR MODIFIED VERSION PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL WRITER, AUTHOR OR ANY CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER; AND
de: DIESES DOKUMENT WIRD »WIE VORLIEGEND« GELIEFERT, OHNE GARANTIEN IRGENDEINER ART, SOWOHL AUSDRÜCKLICH GENANNTE ALS AUCH ANGEDEUTETE. DIES BEZIEHT SICH AUCH OHNE EINSCHRÄNKUNG AUF GARANTIEN, DASS DIESES DOKUMENT ODER VERÄNDERTE FASSUNGEN DIESES DOKUMENTS FREI VON HANDELSDEFEKTEN, FÜR EINEN BESTIMMTEN ZWECK GEEIGNET IST ODER DASS ES KEINE RECHTE DRITTER VERLETZT. DAS VOLLE RISIKO WAS QUALITÄT, GENAUIGKEIT UND LEISTUNG DES DOKUMENTS ODER VERÄNDERTE FASSUNGEN DES DOKUMENTS LIEGT BEI IHNEN. SOLLTE EIN DOKUMENT ODER EINE VERÄNDERTE FASSUNG DAVON FEHLER IRGENDEINER ART BEINHALTEN, TRAGEN SIE (NICHT DER URSPRUNGSAUTOR, DER AUTOR ODER EIN MITWIRKENDER) DIE KOSTEN FÜR NOTWENDIGE DIENSTLEISTUNGEN, REPARATUREN ODER FEHLERKORREKTUREN. DIESER HAFTUNGSAUSSCHLUSS IST EIN ESSENZIELLER TEIL DIESER LIZENZ. DIE VERWENDUNG EINES DOKUMENTS ODER EINER VERÄNDERTEN VERSION DES DOKUMENTS IST NICHT GESTATTET AUßER UNTER BEACHTUNG DIESES HAFTUNGSAUSSCHLUSSES UND

source: UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER IN TORT (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL THE AUTHOR, INITIAL WRITER, ANY CONTRIBUTOR, OR ANY DISTRIBUTOR OF THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO ANY PERSON FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER DAMAGES OR LOSSES ARISING OUT OF OR RELATING TO USE OF THE DOCUMENT AND MODIFIED VERSIONS OF THE DOCUMENT, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES.
de: UNTER KEINEN UMSTÄNDEN UND AUF BASIS KEINER RECHTSGRUNDLAGE, EGAL OB DURCH UNERLAUBTEN HANDLUNGEN (EINSCHLIEßLICH FAHRLÄSSIGKEIT), VERTRAG ODER ANDERWEITIG KANN DER AUTOR, URSPRUNGSAUTOR, EIN MITWIRKENDER ODER EIN VERTRIEBSPARTNER DIESES DOKUMENTS ODER EINER VERÄNDERTEN FASSUNG DES DOKUMENTS ODER EIN ZULIEFERER EINER DIESER PARTEIEN, HAFTBAR GEMACHT WERDEN FÜR DIREKTE, INDIREKTE, SPEZIELLE, VERSEHENTLICHE ODER FOLGESCHÄDEN JEGLICHER ART, EINSCHLIEßLICH UND OHNE EINSCHRÄNKUNGEN SCHÄDEN DURCH VERLUST VON KULANZ, ARBEITSAUSFALL, COMPUTERVERSAGEN ODER COMPUTERFEHLFUNKTIONEN ODER ALLE ANDEREN SCHÄDEN ODER VERLUSTE, DIE SICH AUS ODER IN VERBINDUNG MIT DER VERWENDUNG DES DOKUMENTS UND VERÄNDERTER FASSUNGEN DES DOKUMENTS ERGEBEN, AUCH WENN DIE OBEN GENANNTEN PARTEIEN ÜBER DIE MÖGLICHKEIT SOLCHER SCHÄDEN INFORMIERT WAREN.

source: DOCUMENT AND MODIFIED VERSIONS OF THE DOCUMENT ARE PROVIDED UNDER THE TERMS OF THE GNU FREE DOCUMENTATION LICENSE WITH THE FURTHER UNDERSTANDING THAT: <_:orderedlist-1/>
de: DAS DOKUMENT UND VERÄNDERTE FASSUNGEN DES DOKUMENTS WERDEN UNTER DEN BEDINGUNGEN DER GNU FREE DOCUMENTATION LICENSE ZUR VERFÜGUNG GESTELLT MIT DEM WEITERGEHENDEN VERSTÄNDNIS, DASS: <_:orderedlist-1/>

source: Preface
de: Vorbetrachtung

source: GNOME is a project to build a complete desktop and development platform based entirely on free software. Many companies, governments, schools, institutions, and individuals have deployed the GNOME desktop on their systems. If you are a developer of third-party software ("Independent Software Vendor" or <acronym>ISV</acronym>, or "Independent Software Developer" (<acronym>ISD</acronym>) if you don't do it commercially), you may want to ensure that your existing software runs properly under GNOME. This guide explains how to integrate existing software with GNOME, without actually rewriting that software to explicitly use the GNOME platform libraries and development tools.
de: GNOME ist ein Projekt zur Erstellung einer vollständigen Arbeits- und Entwicklungsumgebung, das vollständig auf freier Software basiert. Viele Unternehmen, Regierungen, Schulen, Institutionen und auch Einzelpersonen setzen die GNOME-Arbeitsumgebung auf ihren Systemen ein. Falls Sie ein Entwickler von Drittanbieter-Software sind (ein »Unabhängiger Softwareanbieter oder <acronym>ISV</acronym>) oder ein »Unabhängiger Softwareentwickler« (<acronym>ISD</acronym>, falls Sie dies auf nicht-kommerzieller Basis tun), möchten Sie gern sicherstellen, dass Ihre Software sauber unter GNOME funktioniert. Dieses Handbuch erklärt, wie Sie vorhandene Software in GNOME integrieren können, ohne die Software unter Verwendung der Bibliotheken der GNOME-Plattform und deren Entwicklungswerkzeugen neu schreiben zu müssen.

source: This guide will be useful in the following situations:
de: Dieses Handbuch könnte in den folgenden Situationen nützlich sein:

source: You are a software developer or distributor who has an application that is not explicitly designed to work with GNOME, but you want to ensure that it runs comfortably within a GNOME desktop.
de: Sie verfügen als Software-Entwickler oder -Anbieter über eine Anwendung, die nicht speziell für die Zusammenarbeit mit GNOME entworfen wurde. Sie möchten dennoch sicherstellen, dass diese Anwendung komfortabel in der GNOME-Arbeitsumgebung läuft.

source: You are a system administrator for an institution that has deployed GNOME desktops to its users. You also have legacy or in-house applications, and you want your users of GNOME to be able to access those applications comfortably.
de: Sie sind ein Systemverwalter einer Institution, die GNOME auf ihren Arbeitsplätzen einsetzt. Sie verfügen über ältere oder spezielle für Sie entworfene Software und möchten sicherstellen, dass die GNOME-Benutzer diese Software komfortabel benutzen können.

source: You are writing a GNOME application proper and you need a checklist of basic things to do to ensure that your application integrates well with the rest of the GNOME desktop.
de: Sie schreiben eine saubere GNOME-Anwendung und benötigen eine Checkliste einiger grundlegenden Dinge, um die Integration Ihrer Anwendung in die übrige Arbeitsumgebung sicherzustellen.

source: In general, this guide is about integrating existing software into a GNOME desktop. On the other hand, if you are considering writing new software, we encourage you to develop it completely with GNOME as your target platform; please refer to the <ulink url="http://developer.gnome.org">GNOME Developer's Site</ulink> for more information.
de: Im Allgemeinen beschäftigt sich dieses Handbuch mit der Integration vorhandener Software in die GNOME-Arbeitsumgebung. Falls Sie jedoch erwägen, neue Software zu schreiben, dann möchten wir Sie ermuntern, diese Software vollständig mit GNOME als Zielplattform zu entwickeln. Weitere Informationen finden Sie auf der <ulink url="http://developer.gnome.org">Webseite der GNOME-Entwickler</ulink>

source: One of the main concerns of GNOME is the user experience. Users should have a comfortable computing environment: this means having a complete desktop and a set of applications which operate together in a consistent way. With relatively little work, applications which are not written explicitly with GNOME in mind can be made to run comfortably within a GNOME desktop.
de: Eines der Hauptanliegen von GNOME ist die Benutzerfreundlichkeit. Die Benutzer sollten eine komfortable Arbeitsumgebung haben. Das bedeutet, über einen kompletten Desktop und eine Reihe von Anwendungen zu verfügen, die in ineinander greifender Art und Weise zusammenarbeiten. Mit relativ wenig Aufwand können Anwendungen, die nicht speziell mit einem GNOME-Hintergrund geschrieben worden sind, für eine komfortable Zusammenarbeit mit der GNOME-Arbeitsumgebung angepasst werden.

source: Structure of this guide
de: Struktur dieses Handbuchs

source: This guide is structured as a list of tasks that you need to perform to integrate existing software with GNOME. The guide presents these tasks roughly in order of importance. For example, the task of adding your application to the GNOME desktop's menus appears before the task for adding drag-and-drop support. Also, this guide has an <link linkend="apx-integration-checklist">appendix with an integration checklist</link> to aid you in evaluating your integration work.
de: Dieses Handbuch ist als Aufgabenliste strukturiert, die Sie zur Integration vorhandener Software in GNOME auszuführen haben. Diese Aufgaben werden in lockerer Folge nach ihrer Bedeutsamkeit dargestellt. Beispielsweise erscheint das Hinzufügen einer Anwendung zu den Desktop-Menüs von GNOME vor dem Hinzufügen der Unterstützung für Ziehen und Ablegen. Außerdem verfügt dieses Handbuch über eine <link linkend="apx-integration-checklist">Checkliste</link>, um Sie bei der Planung Ihrer Integrationsaufgaben zu unterstützen.

source: Standards and freedesktop.org
de: Standards und freedesktop.org

source: Many of the integration tasks in this guide rely on standards which are relevant to more than GNOME. Other desktop projects like the <ulink url="http://www.kde.org">K Desktop Environment</ulink> also use these standards: if you integrate your applications with GNOME, you should have to do little or no extra work to make them run in those other environments as well.
de: Viele der in diesem Handbuch beschriebenen Integrationsaufgaben beziehen sich auf mehr als nur auf GNOME. Weitere Desktop-Projekte, wie das <ulink url="http://www.kde.org">K Desktop Environment</ulink>, verwenden diese Standards ebenfalls. Das bedeutet, dass durch die Integration in GNOME nur wenig oder keine weitere Arbeit nötig ist, um Ihre Anwendung auch in diese anderen Umgebungen einzupassen.

source: Creating a perfect application is a wonderful feeling. Whether large or small, you want the desktop to recognize your application and for them to interact appropriately. With multiple desktops currently available, it is best for your application to be able to integrate itself in as many of them as possible. Even though no official rules have been adopted, there is a set of specifications available at <emphasis>freedesktop.org</emphasis>.
de: Das Entwerfen einer perfekten Anwendung ist ein wundervolles Gefühl. Ob groß oder klein, muss der Desktop die Anwendung gebührend berücksichtigen und angemessen mit ihr interagieren. Durch die Verfügbarkeit mehrerer Umgebungen, ist es das Beste für Ihre Anwendung, sich in möglichst viele von ihnen zu integrieren. Zwar sind noch keine offiziellen Regeln anerkannt worden, aber es gibt eine Reihe von Spezifikationen bei <emphasis>freedesktop.org</emphasis>.

source: Although not a formal standards body, freedesktop.org maintains a set of informal but commonly agreed upon guidelines. When followed, these guidelines allow applications to be integrated on to compliant desktops.
de: Obwohl es sich nicht um formelle Standardisierungen handelt, verwaltet freedesktop.org eine Reihe von unverbindlichen, wiewohl weithin akzeptierten Empfehlungen. Wenn Sie diesen folgen, ermöglichen die Empfehlungen die Integration in die konformen Umgebungen.

source: Basic Integration
de: Grundlegende Integration

source: This chapter teaches you about the very basic steps you should take to integrate a program into the GNOME desktop. These steps concern the following:
de: Dieser Abschnitt führt Sie in die grundlegenden Schritte ein, die Sie zur Integration eines Programms in die GNOME-Arbeitsumgebung ausführen sollten. Diese Schritte umfassen Folgendes:

source: Letting the user launch your application by making it appear in the desktop's panel menus, or any other launching mechanism in the desktop.
de: Lassen Sie den Benutzer Ihre Anwendung starten, indem Sie sie in den Panel-Menüs des Desktops erscheinen lassen, oder in jedem anderen Startmechanismus des Desktops.

source: Letting the desktop know which types of user-created files require your application to be launched.
de: Machen Sie den Desktop mit den Arten der vom Benutzer erzeugten Dateien bekannt, die durch Ihre Anwendung geöffnet werden können.

source: Letting the desktop know how to display the appropriate icons for your program and the files which your program creates.
de: Stellen Sie für den Desktop passende Anwendungssymbole sowie Symbole für die von Ihrer Anwendung erzeugten Dateien bereit.

source: Desktop files: putting your application in the desktop menus
de: Desktop-Dateien: Ihre Anwendung innerhalb der Desktop-Menüs

source: To run applications from GNOME, users click on icons on their desktops or they select the applications which they want to run from a menu. Therefore, the first step in integrating an existing program with GNOME is to <firstterm>register</firstterm> it with the set of applications that users can run.
de: Um Anwendungen in GNOME auszuführen, klicken Anwender auf Symbole auf ihren Desktops oder wählen die zu startenden Anwendungen in einem Menü aus. Daher sollte der erste Schritt für die Integration eines vorhandenen Programms in GNOME die <firstterm>Registrierung</firstterm> in einer Reihe von Anwendungen sein, die Benutzer ausführen können.

source: Unlike in Windows or MacOS, in GNOME the users menus are automatically constructed from the list of registered applications. Each published application specifies a set of categories to which it belongs, and the systems menu configuration sorts and arranges them. This mechanism follows the freedesktop.org desktop entry and menu standards.
de: Im Gegensatz zu Windows oder MacOS werden in GNOME die Benutzermenüs automatisch aus der Liste der registrierten Anwendungen erstellt. Jede verfügbare Anwendung stellt eine Reihe von Kategorien bereit, auf die sie sich bezieht. Die Konfiguration des Systemmenüs sortiert diese und ordnet sie richtig zu. Dieser Mechanismus folgt den Freedesktop.org-Standards für Desktop-Einträge und Menüs.

source: Though common in other desktops, creating your own application-specific submenu is not recommended. Instead, provide one menu item for each application you ship. Extra items such as help files, READMEs or links to your web site should be embedded into the application itself.
de: Obwohl in anderen Desktopumgebungen üblich, wird die Erzeugung eines eigenen, anwendungsspezifischen Untermenüs nicht empfohlen. Stellen Sie stattdessen einen Menüeintrag für jede Ihrer Anwendungen bereit. Zusätzliche Einträge wie Hilfedateien, READMEs oder Verknüpfungen sollten in die Anwendung selbst eingebettet werden.

source: In GNOME and other freedesktop.org-compliant desktops, an application gets registered into the desktop's menus through a <firstterm>desktop entry</firstterm>, which is a text file with <filename>.desktop</filename> extension. This desktop file contains a listing of the configurations for your application. The desktop takes the information in this file and uses it to:
de: In GNOME und auch in anderen Freedesktop.org-kompatiblen Desktops wird eine Anwendung in den Desktop-Menüs anhand eines <firstterm>Desktop-Eintrags</firstterm> registriert. Dies ist eine Textdatei mit der Erweiterung <filename>.desktop</filename>. Diese Desktop-Datei enthält eine Liste von Konfigurationen für Ihre Anwendung. Der Desktop liest die Informationen in dieser Datei aus und verwendet sie zum:

source: put the application in the <guimenu>Main Menu</guimenu>. To find a list of valid categories, take a look into FreeDesktop.org's <ulink url="http://standards.freedesktop.org/menu-spec/latest/">Desktop Menu Specification</ulink>.
de: Einfügen der Anwendung in das <guimenu>Hauptmenü</guimenu>. Eine Liste der möglichen Kategorien finden Sie in der <ulink url="http://standards.freedesktop.org/menu-spec/latest/">Desktop Menu Specification</ulink> von Freedesktop.org.

source: list the application in the <application>Run Application...</application> dialog
de: Auflisten der Anwendung im Dialog <application>Anwendung ausführen …</application>.

source: create appropriate launchers in the menu or on the desktop.
de: Erzeugen entsprechender Anwendungsstarter im Menü oder auf dem Desktop.

source: associate the name and description of the application.
de: Zuordnen des Namens und der Beschreibung einer Anwendung.

source: use the appropriate icon.
de: Zuordnen des richtigen Symbols.

source: recognize the MIME types it supports for opening files.
de: Zuordnen der MIME-Typen, deren Dateien diese Anwendung öffnen kann.

source: To add a menu entry for your application, create a desktop file. It should have a unique filename, and there are no length limits so avoid abbreviations and feel free to include brand names. However, don't put spaces or international characters in the file name. For instance, "foocorp-painter-pro.desktop" would be a good filename to choose but "fcpp.desktop" would be a bad name, as would "FooCorp Painter Pro.desktop". The file should be UTF-8 encoded, and should resemble the following template:
de: Um einen Menüeintrag für Ihre Anwendung hinzuzufügen, erstellen Sie eine Desktop-Datei. Diese sollte einen eindeutigen Dateinamen haben. Für die Länge dieses Namens gibt es keinerlei Beschränkungen, Sie dürfen hier auch Markennamen verwenden. So können Sie Überschneidungen mit anderen Anwendungen zuvorkommen. Vermeiden Sie jedoch Leerzeichen oder internationale Zeichen im Dateinamen. Beispielsweise wäre »foocorp-painter-pro.desktop« ein guter Dateiname, »fcpp.desktop« dagegen nicht, ebenso wie »FooCorp Painter Pro.desktop«. Die Datei sollte in UTF-8 kodiert sein und nach folgender Vorlage gestaltet werden:

source: These desktop files contain metadata about your application, and play a central role in integrating the program with the GNOME and other standards compliant desktops. The template presented here is the most basic possible. The file can be linguistically translated so your applications name can appear in the user's native language.
de: Diese Desktop-Dateien enthalten Metadaten zu Ihrer Anwendungen und spielen eine zentrale Rolle bei der Integration des Programms in GNOME und auch in andere standardkonforme Desktops. Die hier vorgestellte Vorlage ist das absolute Minimum. Die Datei kann in verschiedene Sprachen übersetzt werden, so dass der Name der Anwendung in der jeweiligen Sprache des Benutzers erscheint.

source: Note that the <literal>~/.local/share/applications</literal> location is not monitored by versions of GNOME prior to version 2.10 or on Fedora Core Linux, prior to version 2.8. These versions of GNOME follow the now-deprecated vfolder standard, and so desktop files must be installed to <literal>~/.gnome2/vfolders/applications</literal>. This location is not supported by GNOME 2.8 on Fedora Core nor on upstream GNOME 2.10 so for maximum compatibility with deployed desktops, put the file in both locations.
de: Beachten Sie, dass der Ort <literal>~/.local/share/applications</literal> von Gnome-Versionen vor 2.10 oder auf Fedora-Systemen vor GNOME 2.8 nicht berücksichtigt wird. Diese GNOME-Versionen folgen dem nicht mehr gültigen vfolder-Standard, daher müssen Desktop-Dateien in <literal>~/.gnome2/vfolders/applications</literal> installiert werden. Dieser Ort wird weder von GNOME 2.8 auf Fedora noch von GNOME 2.10 unterstützt. Setzen Sie daher die Datei an beide Orte, um eine höchstmögliche Kompatibilität zu gewährleisten.

source: Note that the KDE Desktop requires one to run <command>kbuildsycoca</command> to force a refresh of the menus.
de: Beachten Sie, dass der KDE-Desktop die Ausführung des Befehls <command>kbuildsycoca</command> erfordert, um eine Aktualisierung der Menüs zu erzwingen.
