Repository: Kr0mAgn0n/gnome-devel-docs
Catalog: integration-guide/*/*.po
Languages: de

source: Place this file in the <literal>/usr/share/applications</literal> directory so that it is accessible by everyone, or in <literal>~/.local/share/applications</literal> if you only wish to make it accessible to a single user. Which is used should depend on whether your application is installed systemwide or into a user's home directory. GNOME monitors these directories for changes, so simply copying the file to the right location is enough to register it with the desktop. <_:footnote-1/>
de: Speichern Sie diese Datei im Ordner <literal>/usr/share/applications</literal>, so dass sie für jeden verfügbar wird, oder in <literal>~/.local/share/applications</literal>, falls nur ein einzelner Benutzer darauf zugreifen können soll. Welcher Ort verwendet wird, ist davon abhängig, ob Ihre Anwendung systemweit oder im persönlichen Ordner eines Benutzers installiert wird. GNOME überprüft diese Ordner regelmäßig auf Änderungen, einfaches Kopieren der Datei an den richtigen Ort genügt, um sie im Desktop zu registrieren. <_:footnote-1/>

source: Each working desktop file needs to follow the same format. A minimal example of a desktop file is shown in <xref linkend="ex-sample-desktop-file"/>. The file is split into sections, each starting with the section descriptor in square brackets. In this example, only one section is shown as that is the essential section to integrating your application to the desktop. Within each section, the part of each line before the equal sign is the <firstterm>key</firstterm> while the second half is the <firstterm>value</firstterm>. An explanation of each line is shown in <xref linkend="tb-desktop-file"/>.
de: Jede funktionierende Desktop-Datei muss dem gleichen Format folgen. Ein Beispiel einer minimalen Desktop-Datei wird in <xref linkend="ex-sample-desktop-file"/> gezeigt. Die Datei ist in Abschnitte unterteilt, wovon jeder mit einer Abschnittsbeschreibung in eckigen Klammern beginnt. In diesem Beispiel wird nur ein Abschnitt gezeigt, der für die Integration Ihrer Anwendung in den Desktop von grundlegender Bedeutung ist. In jedem Abschnitt ist der Teil jeder Zeile vor dem Gleichheitszeichen der <firstterm>key</firstterm>, wobei die zweite Hälfte der Zeile den <firstterm>Wert</firstterm> angibt. Eine Erklärung der einzelnen Zeilen finden Sie in <xref linkend="tb-desktop-file"/>.

source: Other than the first line identifying the desktop file, the order of the lines is not important. In <xref linkend="ex-sample-desktop-file"/>, the line <command>Type=Application</command> could be the second row, the fifth row, or the last row and the result would be the same.
de: Abgesehen von der ersten Zeile zur Identifizierung der Desktop-Datei ist die Reihenfolge der weiteren Zeilen nicht von Bedeutung. In <xref linkend="ex-sample-desktop-file"/> könnte die Zeile <command>Type=Application</command> an zweiter, fünfter oder letzter Stelle stehen, das Ergebnis wäre das Gleiche.

source: However, the keys are case sensitive. <command>Type=Application</command> is not the same as <command>type=Application</command> or <command>TYPE=Application</command>.
de: Die Schlüssel erkennen Groß- und Kleinschreibung. <command>Type=Application</command> ist nicht dasselbe wie <command>type=Application</command> oder <command>TYPE=Application</command>.

source: Sample desktop file
de: Beispiel für eine Desktop-Datei

source: Line by line explanation
de: Zeilenweise Erklärung

source: Line
de: Zeile

source: Description
de: Beschreibung

source: The first line of every desktop file and the section header to identify the block of key value pairs associated with the desktop. Necessary for the desktop to recognize the file correctly.
de: Die erste Zeile jeder Desktop-Datei und der Abschnitts-Kopfzeile, um den Block aus mit dem Desktop verknüpften Schlüssel-Wert-Paaren zu identifizieren. Dies ist für die korrekte Erkennung der Datei durch den Desktop notwendig.

source: Tells the desktop that this desktop file pertains to an application. Other valid values for this key are <command>Link</command> and <command>Directory</command>.
de: Weist den Desktop darauf hin, dass diese Desktop-Datei zu einer Anwendung gehört. Weitere mögliche Werte für diesen Schlüssel sind <command>Link</command> und <command>directory</command>.

source: Describes the encoding of the entries in this desktop file.
de: Beschreibt die Zeichenkodierung der Einträge in dieser Desktop-Datei.

source: <command>Name=Sample Application Name</command>
de: <command>Name=Name der Beispielanwendung</command>

source: Names of your application for the main menu and any launchers.
de: Name der Anwendung für das Hauptmenü und Anwendungsstarter.

source: <command>Comment=A sample application</command>
de: <command>Comment=Eine Beispielanwendung</command>

source: Describes the application. Used as a tooltip.
de: Beschreibt die Anwendung. Wird als Minihilfe angezeigt.

source: The command that starts this application from a shell. It can have arguments.
de: Der Befehl, der die Anwendung in einer Befehlszeile startet. Die Angabe von Argumenten ist möglich.

source: The icon name associated with this application.
de: Der Name des mit dieser Anwendung verknüpften Symbols.

source: Describes whether application should run in a terminal.
de: Gibt an, ob die Anwendung in einem Terminal ausgeführt werden sollte oder nicht.

source: Starting your application
de: Starten Ihrer Anwendung

source: If your application can take command line arguments, you can signify that by using the fields as shown in <xref linkend="tb-exec-params"/>.
de: Falls Ihre Anwendung Befehlszeilenargumente akzeptiert, können Sie das unter Verwendung der in <xref linkend="tb-exec-params"/> gezeigten Felder anzeigen.

source: Exec variables
de: Ausführungsvariablen

source: Add...
de: Hinzufügen von …

source: Accepts...
de: Akzeptiert …

source: a single filename.
de: einen einzelnen Dateinamen.

source: multiple filenames.
de: mehrere Dateinamen.

source: a single URL.
de: eine einzelne Adresse.

source: multiple URLs.
de: mehrere Adressen.

source: a single directory. Used in conjunction with <command>%f</command> to locate a file.
de: einen einzelnen Ordner. Wird in Verbindung mit <command>%f</command> verwendet, um eine Datei anzugeben.

source: multiple directories. Used in conjunction with <command>%F</command> to locate files.
de: mehrere Ordner. Wird in Verbindung mit <command>%F</command> verwendet, um Dateien anzugeben.

source: a single filename without a path.
de: einen einzelnen Dateinamen ohne Pfad.

source: multiple filenames without paths.
de: mehrere Dateinamen ohne Pfade.

source: a URI or local filename of the location of the desktop file.
de: eine Adresse oder einen lokalen Dateinamen eines Ortes in der Desktop-Datei.

source: the name of the Device entry.
de: den Namen des Geräteeintrags.

source: Foreign languages
de: Lokalisierung

source: To create localized names and comments, additional lines for each locale need to be added. For example, to add a Swedish version of the comment, add the following line:
de: Zum Erzeugen von Namen und Kommentaren in weiteren Sprachen müssen Sie zusätzliche Zeilen hinzufügen. Um beispielsweise eine schwedische Version des Kommentars hinzuzufügen, ist folgende Zeile nötig:

source: There is no limit to the number of translations in the file.
de: Die Anzahl der Übersetzungen in der Datei ist nicht begrenzt.

source: Since maintaining a long list of translations in a file is cumbersome, a better way to create these translations is to use the <application>intltool</application> package. See the man pages for <application>intltool-extract</application> and <application>intltool-merge</application> for more information.
de: Weil die Verwaltung einer langen Liste von Übersetzungen in einer Datei eher lästig ist, sollten Sie für deren Erzeugung besser das <application>intltool</application>-Paket verwenden. In den Handbuchseiten von <application>intltool-extract</application> und <application>intltool-merge</application> finden Sie weitere Informationen.

source: References
de: Referenzen

source: <ulink url="http://standards.freedesktop.org/desktop-entry-spec/latest/index.html">Desktop Entry Specification</ulink> — Specifications for creating a desktop file.
de: <ulink url="http://standards.freedesktop.org/desktop-entry-spec/latest/index.html">Desktop Entry Specification</ulink> — Spezifikationen zur Erstellung einer Desktop-Datei.

source: Installing icons
de: Installieren von Symbolen

source: In <xref linkend="ex-sample-desktop-file"/>, we have specified the icon for this application as <filename><replaceable>application.png</replaceable></filename>. In order for this to work, we need to put that icon file in the correct directory.
de: In <xref linkend="ex-sample-desktop-file"/> wurde das Symbol für die Anwendung als <filename><replaceable>application.png</replaceable></filename> festgelegt. Damit dies funktioniert, ist es notwendig, die Symboldatei in den richtigen Ordner zu setzen.

source: The desktop looks for icons in the selected theme directory of <filename>/usr/share/icons/</filename>. Application icons should be available at least at a resolution of 48x48 pixels. Place the icon in <filename>/usr/share/icons/hicolor/48x48/apps/</filename>. This is the directory the desktop looks in if there is no icon for your application in the selected theme. If you have themed icons, put them in the appropriate directories.
de: Der Desktop sucht nach Symbolen im ausgewählten Themen-Ordner von <filename>/usr/share/icons/</filename>. Anwendungssymbole sollten mindestens in einer Ausflösung von 48x48 Pixeln bereitstehen. Setzen Sie das Symbol in <filename>/usr/share/icons/hicolor/48x48/apps/</filename>. Dies ist der Ordner, in dem der Desktop sucht, falls für Ihre Anwendung kein Symbol im ausgewählten Thema zur Verfügung steht. Falls Sie themenbasierte Symbole erstellt haben, setzen Sie diese in die entsprechenden Ordner.

source: To better visually integrate with the GNOME desktop, while keeping your application look native when run under KDE, Windows XP or Mac OS X, follow the <ulink url="http://tango.freedesktop.org/Tango_Icon_Theme_Guidelines">Tango Style guidelines</ulink> when creating your artwork. The document explains various aspects of icon design, including colors, lighting and sizes. Some typical workflow and video tutorials are also provided.
de: Um bessere visuelle Integration in die GNOME-Arbeitsumgebung zu erreichen und doch auch unter KDE, Windows oder MacOS X ein bekanntes Erscheinungsbild zu wahren, sollten Sie den <ulink url="http://tango.freedesktop.org/Tango_Icon_Theme_Guidelines">Tango Style guidelines</ulink> folgen, wenn Sie Symbole erstellen. Das Dokument erklärt die verschiedenen Aspekte beim Entwerfen von Symbolen, einschließlich Farben, Lichteinfall und Größen. Einige typische Arbeitsschritte hierzu und Video-Anleitungen stehen ebenfalls bereit.

source: <ulink url="http://standards.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html">Icon Theme Specification</ulink> — Describes how to install and look up icons in a themeable way.
de: <ulink url="http://standards.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html">Icon Theme Specification</ulink> — Beschreibt die themenbasierte Installation von und Suche nach Symbolen.

source: <ulink url="http://standards.freedesktop.org/icon-naming-spec/latest/">Icon Naming Specification</ulink> — Provides a canonical naming scheme for icon files.
de: <ulink url="http://standards.freedesktop.org/icon-naming-spec/latest/">Icon Naming Specification</ulink> — Stellt ein grundlegendes Benennungsschema für Symboldateien bereit.

source: <ulink url="http://tango.freedesktop.org/Tango_Icon_Theme_Guidelines">Tango Style Guidelines</ulink> — Provides description on how to design clean and 'multiplatform' icon artwork.
de: <ulink url="http://tango.freedesktop.org/Tango_Icon_Theme_Guidelines">Tango Style Guidelines</ulink> — Hier finden Sie eine Beschreibung, wie Sie saubere und plattformübergreifend verwendbare Symbolsätze erstellen können.

source: Adding MIME types
de: Hinzufügen von MIME-Typen

source: If your application can open specific MIME types, you need to let the desktop know in the desktop file. For example, if your application can accept <acronym>PNG</acronym> files, add the following line into your desktop file:
de: Falls Ihre Anwendung spezifische MIME-Typen öffnen kann, sollte der Desktop in der Dasktop-Datei darüber in Kenntnis gesetzt werden. Wenn Ihre Anwendung beispielsweise <acronym>PNG</acronym>-Dateien akzeptiert, fügen Sie die folgende Zeile zur Desktop-Datei hinzu:

source: Additional Mime types can be added by separating the different types with semicolons.
de: Zusätzliche MIME-Typen können Sie einbinden, indem Sie die verschiedenen Typen mit Semikola voneinander trennen.

source: The system already knows of a large number of MIME types. However, if you are creating one of your own, you need to register your MIME type into the MIME database. In the <filename>/usr/share/mime/packages/</filename> directory, create an <acronym>XML</acronym> file with the format as shown in <xref linkend="ex-mime-xml"/>.
de: Das System kennt bereits eine große Anzahl von MIME-Typen. Falls Sie einen eigenen MIME-Typ erstellen wollen, müssen Sie diesen in der MIME-Datenbank registrieren. Erstellen Sie im Ordner <filename>/usr/share/mime/packages/</filename> eine <acronym>XML</acronym>-Datei in dem in <xref linkend="ex-mime-xml"/> gezeigten Format.

source: Sample file for registering a new MIME type
de: Beispieldatei für die Registrierung eines neuen MIME-Typs

source: In this example, replace the example MIME type with the name of your MIME type. The <firstterm>magic</firstterm> section searches files for the search string for identification. The <firstterm>glob</firstterm> line uses the suffix of file names for identification.
de: Ersetzen Sie in diesem Beispiel den vorgegebenen MIME-Typ durch Ihren eigenen MIME-Typ. Der Abschnitt <firstterm>magic</firstterm> sucht Dateien anhand des Suchstrings zur Identifizierung. Die Zeile <firstterm>glob</firstterm> verwendet die Erweiterung des Dateinamens zur Identifizierung.

source: Because the <command>magic</command> command forces the computer to open the files to search for the string, the <command>glob</command> command is preferable.
de: Weil der Befehl <command>magic</command> den Rechner dazu zwingt, die Dateien zur Suche nach dem String zu öffnen, sollte der Befehl <command>glob</command> bevorzugt werden.

source: Once your new MIME type is adequately described in the file, run the following in a shell:
de: Sobald Ihr neuer MIME-Typ angemessen in der Datei beschrieben ist, führen Sie Folgendes in einer Befehlszeile aus:

source: For more information on choosing a good MIME extension and to register your MIME type, go to the <ulink url="http://www.iana.org/cgi-bin/mediatypes.pl">IANA</ulink> website.
de: Weitere Informationen über die Auswahl eines passenden MIME-Typ-Erweiterung und deren Registrierung erhalten Sie auf der <ulink url="http://www.iana.org/cgi-bin/mediatypes.pl">IANA</ulink>-Webseite.

source: <ulink url="http://standards.freedesktop.org/shared-mime-info-spec/latest/">Shared MIME Info Specification</ulink> — Describes the MIME registration system in detail.
de: <ulink url="http://standards.freedesktop.org/shared-mime-info-spec/latest/">Shared MIME Info Specification</ulink> — Beschreibt das MIME-Registrierungssystem im Detail.

source: Deeper Integration with the Desktop
de: Tiefere Integration in den Desktop

source: This chapter contains a list of things which you can do to make your application have better integration with GNOME than the absolute minimum. For example, GNOME is able to display feedback while an application is being launched: you can see how to enable this feedback in <xref linkend="startup-notification"/>. Also, if your software creates documents or other "printable" data, you can install a thumbnailer utility to let the GNOME file manager create thumbnail images specific to your program.
de: Dieser Abschnitt enthält eine Liste, was Sie tun können, um Ihre Anwendung besser in GNOME zu integrieren, über das absolute Minimum hinaus. Beispielsweise ist GNOME fähig, beim Laden einer Anwendung eine Rückmeldung anzuzeigen. Wie Sie dieses Funktionsmerkmal aktivieren können, sehen Sie in <xref linkend="startup-notification"/>. Und falls Ihre Anwendung Dokumente oder andere »druckbare« Daten anlegt, können Sie ein Vorschaubilder-Werkzeug installieren, mit Hilfe dessen der Dateimanager dann Vorschaubilder spezifisch zu Ihrem Programm erzeugen kann.

source: Startup notification
de: Start-Rückmeldungen

source: Although the fields shown in <xref linkend="desktop-files"/> provide enough information for the desktop to recognize your application, there are other fields that may be useful for your particular case. One of these fields is <firstterm>startup notification</firstterm>.
de: Obwohl die in <xref linkend="desktop-files"/> gezeigten Felder genug Informationen für die Berücksichtigung Ihrer Anwendung durch den Desktop bereitstellen, gibt es für bestimmte Fälle einige weitere nützliche Felder. Eines davon ist <firstterm>startup notification</firstterm>.

source: When startup notification is set, the panel and cursor notifies the user that the application has started. When the application appears onscreen, the panel and cursor return to normal.
de: Wenn die Start-Rückmeldung eingeschaltet ist, dann weisen das Panel und der Mauszeiger den Benutzer auf den Start hin. Sobald die Anwendung auf dem Bildschirm erscheint, werden Panel und Mauszeiger in den normalen Zustand zurück versetzt.

source: To let the launcher know your application supports startup notification, add the following line to your desktop file:
de: Um in den Anwendungsstarter die Information einzufügen, dass Ihre Anwendung Start-Rückmeldung unterstützt, fügen Sie die folgende Zeile zu Ihrer Desktop-Datei hinzu:

source: This command in the desktop file enables the desktop to use whatever startup notification is built in to either your application or your toolkit. Most modern toolkits work transparently with the startup notification system. If you are not using a modern toolkit, the <ulink url="http://freedesktop.org/wiki/Standards_2fstartup_2dnotification_2dspec">Startup Notification Spec</ulink> has the details that you need to implement it yourself.
de: Dieser Befehl in der Desktop-Datei aktiviert eine Form der Start-Rückmeldung in Ihrem Desktop, die entweder durch Ihre Anwendung oder die Entwicklungsumgebung bereitgestellt wird. Die meisten modernen Entwicklungsumgebungen arbeiten nachvollziehbar mit dem Rückmeldungssystem. Wenn Sie eine solche Entwicklungsumgebung verwenden, dann hilft Ihnen die <ulink url="http://freedesktop.org/wiki/Standards_2fstartup_2dnotification_2dspec">Startup Notification Spec</ulink> bei dessen Implementation.

source: Regardless of toolkit, there is one type of application where you would have to manually handle feedback. Applications with remoting capabilities (where you tell an existing process to open a new window instead of starting a new process) cannot use the built-in mechanism. The value of the DESKTOP_LAUNCH_ID environment has to be passed by your application and have it notify the launching system of your new window. If you are using <application>GTK+</application>, the documentation for <function>gdk_notify_startup_complete()</function> has a bit more information.
de: Unabhängig von der eingesetzten Entwicklungsumgebung gibt es einen Anwendungstyp, bei dem Sie manuell für die Anzeige von Rückmeldungen sorgen müssen. Anwendungen, bei denen ein neues Anwendungsfenster geöffnet wird, ohne einen neuen Prozess zu starten, können auf diesen Mechanismus nicht zurückgreifen. Der Wert der Variablen DESKTOP_LAUNCH_ID muss an Ihrer Anwendung vorbeigeleitet werden, so dass das Rückmeldungssystem des neuen Fensters funktioniert. Falls Sie <application>GTK+</application> verwenden, finden Sie in der Dokumentation von <function>gdk_notify_startup_complete()</function> etwas mehr Information.

source: <ulink url="http://standards.freedesktop.org/startup-notification-spec/startup-notification-latest.txt">Startup Notification Protocol</ulink> — Describes the low-level details of how startup notification is implemented in the X Window System.
de: <ulink url="http://standards.freedesktop.org/startup-notification-spec/startup-notification-latest.txt">Startup Notification Protocol</ulink> — Beschreibt grundlegende Details der Implementation von Start-Rückmeldungen im X-Window-System.

source: Installing a Thumbnailer Program
de: Installation eines Vorschaubilder-Programms

source: The GNOME file manager, Nautilus, can display little thumbnails tailored for each file instead of generic icons in its file lists. For example, a word processor document can be made to appear as a little version of the first page in the document. This is useful because users can see a small representation of the visible data in their files, which may aid in recalling what file they are looking for. You can make your application create these thumbnails with a few simple steps.
de: Der GNOME-Dateimanager <application>Nautilus</application> kann kleine Vorschaubilder für Dateien anstelle von allgemeinen Symbolen in seinen Dateilisten anzeigen. Beispielsweise kann das Dokument einer Textverarbeitung eine verkleinerte Version der ersten Seite dieses Dokuments anzeigen. Das ist nützlich, weil Benutzer dadurch eine kleine Vorschau der sichtbaren Daten in ihren Dateien sehen, was sie bei der Suche nach Dateien unterstützt. Mit einigen wenigen Schritten statten Sie Ihre Anwendung mit dieser Funktionalität aus.

source: A <firstterm>thumbnailer</firstterm> is a program with no user interface that takes a file and a pixel size as inputs, and it writes a thumbnail for that file. GNOME determines which thumbnailer program to use based on the MIME type of the file for which a thumbnail is to be generated. The mapping between MIME types and thumbnailer programs is stored as a series of GConf keys.
de: Ein <firstterm>Thumbnailer</firstterm> ist ein Programm ohne Benutzerschnittstelle, das anhand einer Datei und eines Pixelwerts als Eingabe eine Vorschau für diese Datei erstellt. GNOME stellt anhand des MIME-Typs der Datei fest, welches Vorschaubilder-Programm für die Erzeugung in Frage kommt. Die Zuordnung von MIME-Typen zu den Vorschaubilder-Programmen geschieht mit einer Reihe von GConf-Schlüsseln.

source: For each MIME type which you want to handle, you have to create a pair of GConf keys:
de: Für jeden zu verarbeitenden MIME-Typ müssen sie ein GConf-Schlüsselpaar erstellen:

source: Type: boolean. Determines whether this thumbnailer will be run. You can enable or disable each individual thumbnailer. When you install a new thumbnailer, you should of course make this key's value be <symbol>true</symbol>.
de: Typ: boolean. Legt fest, ob dieser Thumbnailer ausgeführt wird. Sie können jeden individuellen Thumbnailer aktivieren oder deaktivieren. Wenn Sie einen neuen Thumbnailer installieren, müssen Sie den Wert dieses Schlüssels natürlich auf »WAHR« setzen.

source: Type: string. The command which GNOME will use when it needs to generate a thumbnail for a file of type <replaceable>application@x-foo</replaceable>. For example, the value could be "<literal>application-x-foo-thumbnailer %i %o %s</literal>". See below for an explanation of the percent signs.
de: Typ: string. Der Befehl, den GNOME verwendet, wenn die Erzeugung eines Vorschaubildes für eine Datei des Typs <replaceable>application@x-foo</replaceable> notwendig ist. Beispielsweise könnte der Wert »<literal>application-x-foo-thumbnailer %i %o %s</literal>« sein. Nachfolgend finden Sie eine Erklärung der Prozentzeichen.
