Repository: Kr0mAgn0n/gnome-devel-docs
Catalog: platform-overview/*/*.po
Languages: pt_br

source: In addition to a flexible plugin architecture, <application>Nautilus</application> can also display a thumbnail for any type of file for which a thumbnailer has been provided. Thumbnails show a preview of the file, helping users find the files they want. GNOME can automatically create thumbnails for most image and movie files, and allows applications to install additional thumbnailer programs to create thumbnails for application-specific files. Thumbnail management is fully specified by <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink>, so any thumbnailers you provide can be used by all applications.
pt_br: Além de uma arquitetura flexível de plug-in, o <application>Nautilus</application> também pode exibir uma miniatura para cada tipo de arquivo pelo qual um miniaturizador foi oferecido. Miniaturas mostram uma visualização prévia do arquivo, auxiliando os usuários encontrarem seus arquivos quando necessitem. O Gnome pode automaticamente criar miniaturas da maioria dos arquivos de imagem e vídeo e permite que aplicativos instalem programas de miniaturização adicionais para criar miniaturas para arquivos de aplicativos específicos. O gerenciamento de miniaturas é amplamente especificado em <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink>, portanto quaisquer miniaturizadores que você fornecer poderão ser utilizados por todos os aplicativos.

source: Window Manager
pt_br: Gerenciamento de janelas

source: The window manager is a special program responsible for drawing the borders and titlebars around windows. The window manager is responsible for handling all the operations performed on windows, such as moving, resizing, minimizing, and moving between workspaces. Windows are managed consistently with little or no work from application developers. When applications need to influence the window manager, they can provide hints on their windows using function calls in GTK+.
pt_br: O gerenciador de janela é um programa especial responsável por desenhar as bordas e as barras de título ao redor das janelas. O gerenciador de janelas é responsável por manipular todas as operações realizadas nas janelas como movimentação, redimensionamento, minimização e movimentação entre espaços de trabalho. As janelas são gerenciadas de forma consistente com pouco ou nenhum trabalho para os desenvolvedores de aplicativos. Quando os aplicativos precisam influenciar o gerenciador de janelas, eles podem fornecer dicas nas suas janelas usando chamadas de função no GTK+.

source: External programs can, however, interact directly with the window manager, and even control its behavior. Using GNOME's libwnck library, applications can get information about the placement and state of all the windows and instruct the window manager to perform various actions on those windows.
pt_br: Porém programas externos podem interagir diretamente com o gerenciador de janelas e até controlar seu comportamento. Ao utilizar a biblioteca libwnck do GNOME, os aplicativos podem obter informações sobre a disposição e o estado de todas as janelas e instruir o gerenciador de janelas para realizar várias ações naquelas janelas.

source: The libwnck library isn't specific to GNOME's window manager. All of its functionality uses the Extended Window Manager Hints, or EWMH. EWMH was developed jointly with <ulink url="http://www.freedesktop.org">freedesktop.org</ulink> to provide unified window manager interaction across multiple desktops.
pt_br: A biblioteca libwnck não é específica do gerenciador de janelas do GNOME. Toda a sua funcionalidade usa as dicas estendidas do gerenciador de janelas (Extended Window Manager Hints - EWMH). O EWMH foi desenvolvido juntamente com o <ulink url="http://www.freedesktop.org">freedesktop.org</ulink> para oferecer interação de gerenciamento de janelas unificado entre múltiplas áreas de trabalho.

source: Window manager interaction with libwnck can be used for simple tasks, such as displaying workspace and window list applets on the user's panel, as well as for complex applications, such as performing automatic actions on new windows based on certain window properties.
pt_br: A interação do gerenciador de janelas com a libwnck pode ser usada para tarefas simples, como a exibição do espaço de trabalho e a lista de miniaplicativos em janela no painel do usuário, assim como para aplicativos complexos, como a realização de ações automáticas em novas janelas baseadas em certas propriedades de janela.

source: Control Center
pt_br: Centro de controle

source: The GNOME desktop provides a single menu of all the desktop-wide preferences and system administration settings. Preferences and settings dialogs can be placed in this menu to make them easily accessible. Dialogs can be placed in the preferences menu by adding them to the applications registry with the <literal>Setting</literal> category. Dialogs can be placed in the administration menu using both the <literal>Settings</literal> and <literal>System</literal> categories.
pt_br: A área de trabalho GNOME oferece um menu único de todas as preferências abrangentes da área de trabalho e das configurações de administração do sistema. As janelas de diálogo de preferências e de configurações podem ser inseridas neste menu para fazê-las facilmente acessíveis. As janelas de diálogos podem ser inseridas no menu de preferências adicionando-as ao registro de aplicativos com a categoria <literal>Configuração</literal>. As janelas de diálogo podem ser inseridas no menu de administração usando tanto as categorias <literal>Configurações</literal> quanto a categoria <literal>Sistema</literal>.

source: If you provide a dialog that allows administrators to configure desktop systems, then you should add your dialog to the administration menu. If you provide a dialog that allows users to adjust preferences that affect a number of applications, then you should add your dialog to the preferences menu. You should not use these global menus for individual application preferences.
pt_br: Se você oferecer uma janela de diálogo que permite aos administradores configurarem sistemas de área de trabalho, então você deve adicionar sua janela de diálogo ao menu de administração. Se você oferecer uma janela de diálogo que permite aos usuários ajustarem as preferências que afetam uma porção de aplicativos, então você deve adicionar sua janela de diálogo ao menu de preferências. Você não deve usar estes menus globais para preferências de aplicativos individuais.

source: Storing Passwords
pt_br: Armazenamento de senhas

source: GNOME provides a modern and secure keyring manager to store users' passwords and other sensitive data. Applications can use the keyring manager library to store and access passwords, and users can manage their passwords using GNOME's <application>Seahorse</application> application.
pt_br: O GNOME oferece um gerenciador de chaveiros moderno e seguro para armazenar as senhas do usuário e outros dados sensíveis. Aplicativos podem utilizar a biblioteca do gerenciador de chaveiros para armazenar e acessar senhas e os usuários podem gerenciar suas senhas usando o aplicativo <application>Gerenciador de chaveiros</application> do GNOME.

source: The keyring manager provides any number of keyrings, where each keyring can contain any number of keyring items. Items in a keyring store some piece of data, often a password. Each keyring is locked individually, and users must provide a password to unlock the keyring. Once a keyring has been unlocked, the user has access to all of the items in that keyring.
pt_br: O gerenciador de chaveiros oferece uma porção de chaveiros, onde cada chaveiro pode conter qualquer quantidade de itens de chaveiro. Os itens em um chaveiro armazenam alguma porção de dados, geralmente uma senha. Cada chaveiro é trancado individualmente e os usuários precisam fornecer uma senha para destrancá-lo. Uma vez que o chaveiro seja destrancado, o usuário possui acesso a todos os itens daquele chaveiro.

source: The keyring manager provides access control lists for each keyring item, controlling which applications are allowed access to that item. If an unknown application attempts to access a keyring item, the keyring manager will prompt the user to allow or deny that application access. This helps prevent malicious or poorly-written programs from accessing the user's sensitive data.
pt_br: O gerenciador de chaveiros oferece acesso à listas de controles para cada item do chaveiro, controlando quais aplicativos possuem permissão para acessar aquele item. Se um aplicativo desconhecido tenta acessar um item do chaveiro, o gerenciador de chaveiros irá avisar ao usuário para permitir ou negar o acesso daquela aplicação. Isto ajuda prevenir programas maliciosos ou mal escritos de acessarem os dados sensíveis dos usuários.

source: Keyring data stored on the file system is encrypted with the AES block cipher, and SHA1 is used for hashes of the item's attributes. Using the attributes hash, the keyring manager is able to look up items requested by applications without ever unlocking the keyring. The keyring has to be unlocked when a matching item is found and accessed.
pt_br: Os dados dos chaveiros armazenados no sistema de arquivos é encriptado com o cifrador de bloco AES e o SHA1 é utilizado para "hashear" os atributos do item. Usando os atributos de hash, o gerenciador de chaveiros é capaz de consultar os itens solicitados pelos aplicativos sem nunca ter que destrancar o chaveiro. O chaveiro tem que ser destrancado quando um item correspondente é encontrado e acessado.

source: The keyring manager also provides a session keyring. Items in the session keyring are never stored on disk, and are lost as soon as the user's session ends. The session keyring can be used to store passwords to be used in the current session only.
pt_br: O gerenciador de chaveiros também oferece uma sessão de chaveiro. Itens na sessão de chaveiro nunca são armazenados no disco e são perdidos assim que a sessão do usuário seja encerrada. A sessão de chaveiro pode ser usada para armazenar senhas que serão utilizadas apenas na sessão atual.

source: If you use GIO to access remote servers, you automatically get the benefits of the keyring manager. Whenever GVFS needs to authenticate the user, it provides the option to store the password, either in the default keyring or in the session keyring.
pt_br: Se você usa GIO para acessar servidores remotos, você automaticamente obterá os benefícios do gerenciador de chaveiros. Toda vez que o GVFS precisa autenticar o usuário, ele fornece a opção de armazenar a senha, tanto no chaveiro padrão quanto na sessão do chaveiro.

source: You should use the keyring manager whenever your application needs to store passwords or other sensitive data for users. Using the keyring manager provides a better user experience while still keeping user data safe and secure.
pt_br: Você deveria usar o gerenciador de chaveiros toda vez que seu aplicativo precise armazenar senhas ou outros dados sensíveis para o usuários. Ao usar o gerenciador de chaveiros oferece-se uma melhor experiência de usuário enquanto ainda mantém os dados do usuário à salvo e em segurança.

source: For API references please see the <ulink url="http://library.gnome.org/devel/gnome-keyring/stable/">gnome-keyring Reference Manual</ulink> and the <ulink url="http://library.gnome.org/devel/libseahorse/stable/">libseahorse Reference Manual</ulink>.
pt_br: Para maiores informações sobre a API, consulte o <ulink url="http://library.gnome.org/devel/gnome-keyring/stable/">Manual de referência do Chaveiro do GNOMEe o <ulink url="http://library.gnome.org/devel/libseahorse/stable/">Manual de referência do libseahorsel</ulink>.

source: Session Management
pt_br: Gerenciamento de sessões

source: GNOME provides tools to allow your application to run smoothly from session to session. Users can log out with running applications and have those applications fully restored when they log back in. To provide this functionality, your application must connect to the session manager and save its state when the user logs out.
pt_br: O GNOME oferece ferramentas que permitem seu aplicativo executar suavemente de sessão para sessão. Os usuários podem encerrar a sessão com aplicativos em execução e ter estes aplicativos completamente restaurados quando a sessão retorna. Para oferecer esta funcionalidade, seu aplicativo precisa conectar-se ao gerenciador de sessões e salvar seu estado quando o usuário encerra a sessão.

source: GNOME provides a simple API for session management in the GNOME User Interface Library. See the section <ulink url="http://library.gnome.org/devel/libgnomeui/stable/GnomeClient.html">GnomeClient</ulink> of the <ulink url="http://library.gnome.org/devel/libgnomeui/stable/">GNOME UI Library Reference Manual</ulink> for more information on working with the GNOME session manager.
pt_br: O GNOME oferece uma API simples para gerenciamento de sessões na Biblioteca de interface de usuário do GNOME. Veja a sessão <ulink url="http://library.gnome.org/devel/libgnomeui/stable/GnomeClient.html">GnomeClient</ulink> do <ulink url="http://library.gnome.org/devel/libgnomeui/stable/">Manual de referência da biblioteca de interface do GNOME</ulink> para maiores informações sobre como trabalhar com o gerenciador de sessões do GNOME.

source: Address Book and Calendar
pt_br: Catálogo de endereços e Calendário

source: With Evolution Data Server, GNOME provides a single address book and calendar that all applications can use to store and retrieve information. Using Evolution Data Server means that users no longer have to maintain separate lists of contacts in each application, or manually copy events to their calendar.
pt_br: Como o servidor de dados Evolution, o GNOME oferece um único calendário e catálogo de endereços que todos os aplicativos podem usar para armazenar e recuperar informações. Usar o servidor de dados do Evolution significa que os usuários não precisarão mais manter listas separadas de contatos em cada aplicativo ou manualmente copiar eventos ao calendário.

source: People use computers increasingly to interact with their friends and colleagues. Applications such as email programs, instant messengers, and telephony and video conferencing applications are used to communicate with others. These applications often provide contact lists to help users. Using Evolution Data Server, applications can store contact information in a single location, allowing all applications to see all the pertinent data about users' contacts.
pt_br: As pessoas usam cada vez mais computadores para se interagirem com seus amigos e colegas. Aplicativos como programas de e-mail, mensageiros instantâneos e aplicativos de tele e vídeo conferência são usados para a comunicação com os outros. Esses aplicativos geralmente oferecem listas de contatos para ajudar os usuários. Ao usar o servidor de dados Evolution, os aplicativos podem armazenar informações sobre contatos em um único local, permitindo que todos os aplicativos consultem todos os dados pertinentes a respeito dos contatos do usuário.

source: Applications can also use Evolution Data Server to store and retrieve appointments on the user's calendar. For example, the clock on the panel shows a simple calendar when clicked. If the user has any appointments scheduled, they are shown alongside the calendar. This makes it easy to see upcoming appointments without opening a full calendar application.
pt_br: Os aplicativos também podem utilizar o servidor de dados Evolution para armazenar e recuperar compromissos no calendário do usuário. Por exemplo, o relógio no painel mostra um simples calendário quando clicado. Se o usuário tiver quaisquer compromissos agendados, eles serão exibidos juntamente com o calendário. Isto facilita a visualização de compromissos futuros sem abrir um aplicativo completo de calendário.

source: For more information on the address book, see <ulink url="http://gnome.org/projects/evolution/developer-doc/libebook/ch01.html"> Evolution API Reference: libebook</ulink>. For more information on the calendar, see <ulink url="http://gnome.org/projects/evolution/developer-doc/libecal/index.html"> Evolution API Reference: libecal</ulink>.
pt_br: Para maiores informações sobre o catálogo de endereços, veja o <ulink url="http://gnome.org/projects/evolution/developer-doc/libebook/ch01.html"> Libebook: referência API do Evolution</ulink>. Para maiores informações sobre o calendário, veja o <ulink url="http://gnome.org/projects/evolution/developer-doc/libecal/index.html"> Libecal: referência API do Evolution</ulink>.

source: Usability
pt_br: Usabilidade

source: The GNOME desktop is designed around usability, and it aims to provide a consistent and simple user experience. People use computers to get work done (or to play!), not to figure out complicated user interface puzzles. When designing your application, you should consider how well users can recognize common user interface paradigms, how quickly they can learn the elements that are unique to your application, and how efficiently they can execute tasks once they've learned them.
pt_br: A área de trabalho GNOME é projetada em torno de usabilidade e visa fornecer uma experiência de usuário simples e consistente. As pessoas usam computadores para fazerem trabalhos (ou para jogarem!), não para solucionarem complexas e enigmáticas interfaces de usuário. Quando você projetar seu aplicativo, você deve considerar o quanto bem os usuários poderão reconhecer os paradigmas de interface de usuário comuns, o quão rapidamente eles podem aprender os elementos que são únicos no seu aplicativo e o com qual eficiência eles podem executar tarefas uma vez que eles aprenderam-nas.

source: GNOME provides comprehensive Human Interface Guidelines to help you write applications that are attractive and usable. While no guidelines can provide a single answer for all usability concerns, understanding the GNOME Human Interface Guidelines can make it easier to create a usable application. For more information, please see the <ulink url="http://library.gnome.org/devel/hig-book/stable/">GNOME Human Interface Guidelines</ulink>.
pt_br: O GNOME oferece uma compreensiva guia de diretrizes de interface humana para ajudá-lo a escrever aplicativos atraentes e úteis. Enquanto nenhuma guia pode fornecer uma única resposta para todos os problemas de usabilidade, entender a guia de diretrizes de interface humana do GNOME pode facilitar a criação de um aplicativo útil. Para maiores informações, por gentileza visite a <ulink url="http://library.gnome.org/devel/hig-book/stable/">Guia de diretrizes de interface humana do GNOME</ulink>.

source: Documentation
pt_br: Documentação

source: All applications should provide documentation to help their users understand the application and troubleshoot problems that may arise. While a well-designed application should not require reading the documentation before use, documentation can nonetheless be an important tool for users, particularly for complex applications.
pt_br: Todos os aplicativos deveriam fornecer documentação para auxiliar seus usuários compreenderem o aplicativo e resolverem problemas que possam surgir. Enquanto um aplicativo bem projetado não deveria exigir a leitura da documentação após seu uso, contudo a documentação pode ser uma importante ferramenta para os usuários, particularmente para aplicativos complexos.

source: GNOME provides a unified framework for providing user documentation. You can provide documentation in the industry-standard DocBook format. Using DocBook means that you don't have to worry about formatting details. Instead, your documentation will be automatically formatted with the same consistent conventions as the rest of the system documentation.
pt_br: O GNOME oferece um framework unificado para fornecer documentação de usuário. Você pode oferecer documentação no estilo de formato padrão industrial do DocBook. Usar DocBook significa não ter de se preocupar com detalhes de formatação. Ao invés disso sua documentação será automaticamente formatada com as mesmas convenções coerentes como o resto da documentação do sistema.

source: GNOME's help viewer, <application>Yelp</application>, displays and prints documentation, provides a listing of all documentation on the system, and allows the user to search the full text of all documentation. Using the GNOME help system gives you all these features for free.
pt_br: O visualizado de ajuda do GNOME, o <application>Yelp</application>, exibe e imprime documentações, oferece uma listagem de todas as documentações no sistema e permite aos usuários pesquisarem o texto completo de todas as documentações. Ao usar o sistema de ajuda do GNOME você ganha todas estes aprimoramentos gratuitamente.

source: For more information on writing documentation for your application, see the <ulink url="http://library.gnome.org/devel/gdp-handbook/stable/">GNOME Handbook of Writing Software Documentation</ulink>, <ulink url="http://www.docbook.org/tdg/en/html/docbook.html">DocBook: The Definitive Guide</ulink>, and the <ulink url="http://library.gnome.org/devel/gdp-style-guide/stable/">GNOME Documentation Style Guide</ulink>.
pt_br: Para maiores informações sobre como escrever documentações para seu aplicativo, consulte o <ulink url="http://library.gnome.org/devel/gdp-handbook/stable/">Manual de elaboração de documentação para softwares GNOME</ulink>, <ulink url="http://www.docbook.org/tdg/en/html/docbook.html">DocBook: O guia definitivo</ulink>, e o <ulink url="http://library.gnome.org/devel/gdp-style-guide/stable/">Guia de estilo da documentação GNOME</ulink>.

source: Graphical Interfaces
pt_br: Interfaces gráficas

source: Most applications will need to provide a graphical interface to interact with users. Graphical interfaces can create an intuitive and discoverable medium for people to interact with software, and users expect applications to provide usable and attractive user interfaces.
pt_br: A maioria dos aplicativos precisarão oferecer uma interface gráfica para interagir com o usuário. Interfaces gráficas podem criar um meio intuitivo e acessível para as pessoas interagirem com o software, aliás usuários esperam que os aplicativos forneçam interfaces de usuário atrativas e úteis.

source: The GNOME Platform features sophisticated graphics and user interface technology, from standard user interface controls to an API for drawing high-quality graphics to the screen. Using the graphics technologies in GNOME allows you to create applications that are consistent, intuitive, and aesthetically pleasing.
pt_br: A plataforma GNOME apresenta gráficos e tecnologias de interface de usuário sofisticadas, a partir de controles padrão de interface de usuário até uma API para desenhar gráficos de alta qualidade na tela. Ao utilizar as tecnologias gráficas do Gnome permite-se criar aplicativos que são consistentes, intuitivos e esteticamente agradáveis.

source: Layered Look at Graphics Libraries
pt_br: Visualização superimposta das Bibliotecas Gráficas

source: GTK+ is the primary library used to construct user interfaces in GNOME. It provides all the user interface controls, or widgets, used in a common graphical application. Its modern, object-oriented API allows you to construct attractive and sophisticated user interfaces without dealing with the low-level details of drawing and device interaction.
pt_br: GTK+ é a principal biblioteca utilizada para a construção de interfaces de usuário no GNOME. Ela fornece todos os controles de interface de usuário, ou widgets, usadas em uma aplicação gráfica comum. Ela é moderna e as APIs orientadas a objetos permitem a construção de interfaces de usuário atraentes e sofisticadas sem ter que lidar com detalhes de baixo nível de desenho e interação de dispositivos.
