Repository: Kr0mAgn0n/gnome-devel-docs
Catalog: platform-overview/*/*.po
Languages: pt_br

source: The system bus is a single message bus which runs independently of any user sessions. It can communicate with applications in any session, enabling those applications to interact with system components without dealing with low-level system details. The system bus is used to provide important functionality that users expect to work on their systems. For example, the system bus is used to monitor when network interfaces go up or down, when external drives get plugged in, and when laptop batteries are low.
pt_br: O barramento de sistema é um barramento de mensagem simples que roda independentemente de quaisquer sessões de usuário. Ele pode se comunicar com aplicativos em qualquer sessão, permitindo estes aplicativos interagirem com os componentes de sistema sem lidar com detalhes de baixo nível do sistema. O barramento de sistema é utilizado para fornecer funcionalidades importantes que os usuários esperam que funcionem em seus sistemas. Por exemplo, o barramento de sistema é utilizado para monitorar quando interfaces de rede estão ativadas ou desativadas, quando dispositivos externos são plugados e quando baterias de laptop estão fracas.

source: D-Bus is developed jointly on <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink>, so you can use it with different desktop environments and applications. Because D-Bus is a cross-desktop project, you use it to create portable and versatile software that seamlessly integrates with the user's desktop, regardless of which desktop it is.
pt_br: D-Bus é desenvolvido juntamente em <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink>, então você pode utilizá-lo em diferentes ambientes de trabalho e aplicativos. Pelo D-Bus ser um projeto multi-ambiente você pode utilizá-lo para criar softwares portáteis e versáteis que discretamente se integram com a área de trabalho dos usuários, independente de qual ambiente de trabalho seja.

source: For more information on D-Bus, see <ulink url="http://dbus.freedesktop.org/doc/dbus-tutorial.html">The D-BUS Tutorial</ulink> and <ulink url="http://dbus.freedesktop.org/doc/dbus-specification.html">The D-BUS Specification</ulink>.
pt_br: Para maiores informações sobre o D-Bus, consulte <ulink url="http://dbus.freedesktop.org/doc/dbus-tutorial.html">O tutorial do D-BUS</ulink> e <ulink url="http://dbus.freedesktop.org/doc/dbus-specification.html">A especificação do D-BUS</ulink>.

source: Bonobo and CORBA
pt_br: Bonobo e CORBA

source: Bonobo is a framework for creating reusable components for use in applications. Built on top of the industry-standard Common Object Request Broker Architecture (CORBA), Bonobo provides all the common interfaces needed to create and use well-behaved components in GNOME applications.
pt_br: Bonobo é um framework para criar componentes reutilizáveis para serem utilizados em aplicativos. Construído sobre os padrões industriais do "Common Object Request Broker Architecture" (CORBA), o Bonobo oferece todas as interfaces comuns necessárias para criar e utilizar componentes bem intencionados nos aplicativos GNOME.

source: Bonobo components can be used in a variety of situations, and can help create flexible and extensible software. For example, a component to display multimedia content could be embedded inside a word processor, effectively adding multimedia support to the word processor without the word processor working directly with it. Bonobo components are also used to embed the applets in the GNOME panel. Using Bonobo enables the applets to communicate effectively with the panel, affording users a consistent interface.
pt_br: Os componentes do Bonobo podem ser utilizados em uma variedade de situações e podem ajudar a criar softwares extensíveis e flexíveis. Por exemplo, um componente para exibir conteúdo multimídia pode ser incorporado dentro de um processador de texto, efetivamente adicionando suporte multimídia ao processador de texto sem que o processador de texto trabalhe diretamente com ele. Os componentes do Bonobo são utilizados também para incorporar os miniaplicativos do painel GNOME. Ao utilizar o Bonobo os miniaplicativos podem comunicar-se efetivamente com o painel do GNOME, proporcionando aos usuários uma interface consistente.

source: Bonobo components are not limited to graphical controls. Bonobo was used by Evolution, GNOME's email and groupware suite, to provide access to users' addressbook and calendar. This allows users to keep all their information in one place, where all applications can access it.
pt_br: Os componentes Bonobo não são limitados apenas a controles gráficos. O Bonobo é utilizado pelo Evolution, suíte de trabalho colaborativo e correio eletrônico do GNOME, para fornecer acesso ao caderno de endereços e calendário. Isto permite aos usuários guardarem todas as suas informações em um local onde todos os aplicativos podem ter acesso.

source: Bonobo is built off of CORBA, allowing components to run in seperate processes. Components can be written in different languages and run on top of different runtimes; they need only adhere to an interface specified with the Interface Definition Language (IDL). CORBA's flexible design even allows components to run on seperate machines over a network.
pt_br: Bonobo é construído fora do CORBA, permitindo que os componentes sejam executados em processos separados. Os componentes podem ser escritos em diferentes linguagens e executados sobre diferentes tempos de execução; eles apenas precisam aderir a uma interface especificada com a Interface Definition Language (IDL). O design flexível do CORBA ainda permite que os componentes sejam executados em máquinas separadas sobre uma rede.

source: GNOME provides its own fast and lightweight CORBA implementation with ORBit. The tools and libraries supplied with GNOME even allow components to be written effectively in C, a language often excluded by other CORBA implementations. ORBit is an incredibly fast CORBA implementation.
pt_br: O GNOME fornece sua própria implementação rápida e leve de CORBA com o ORBit. As ferramentas e bibliotecas fornecidas com o GNOME ainda permitem que componentes sejam efetivamente escritos em C, uma linguagem geralmente excluída por outras implementações CORBA. ORBit é uma implementação CORBA incrivelmente rápida.

source: Bonobo helps fill the gaps in CORBA, providing the additional interfaces and specifications needed to support consistent components. Although you will rarely need to use CORBA without Bonobo, it can be used directly. For instance, GNOME's accessibility infastructure uses CORBA to allow assistive tools to inspect and interact with running applications.
pt_br: Bonobo ajuda a preencher as lacunas do CORBA, oferecendo as interfaces e especificações adicionais necessárias para dar suporte aos componentes compatíveis. Apesar de você raramente precisar utilizar CORBA sem Bonobo, isso pode ser usado diretamente. Por exemplo, a infraestrutura de acessibilidade do GNOME utiliza CORBA para permitir que ferramentas assistivas inspecionem e interajam com aplicativos em execução.

source: You may wish to use Bonobo to provide complex graphical components that can be embedded into applications. For most IPC needs, however, GNOME is moving towards D-Bus, as integrating D-Bus into applications is considerably easier.
pt_br: Você pode desejar utilizar Bonobo para fornecer componentes gráficos complexos que podem ser embutidos em aplicativos. No entanto, para a maioria das necessidades de IPC, GNOME está indo em direção ao D-Bus, tendo em vista que integrar D-Bus dentro de aplicativos é considerado fácil.

source: For more information on Bonobo, see the <ulink url="http://library.gnome.org/devel/libbonobo/stable/">Libbonobo Reference Manual</ulink> and the <ulink url="http://library.gnome.org/devel/libbonoboui/stable/">LibbonoboUI Reference Manual</ulink>. For information on ORBit, GNOME's CORBA implementation, see the <ulink url="http://library.gnome.org/devel/ORBit2/stable/">ORBit2 Reference Manual</ulink>.
pt_br: Para maiores informações sobre o Bonobo, consulte o <ulink url="http://library.gnome.org/devel/libbonobo/stable/">Manual de referência Libbonobo</ulink> e o <ulink url="http://library.gnome.org/devel/libbonoboui/stable/">Manual de referência LibbonoboUI</ulink>. Para informações sobre o ORBit, a implementação CORBA do GNOME, consulte o <ulink url="http://library.gnome.org/devel/ORBit2/stable/">Manual de referência ORBit2</ulink>.

source: Service Discovery
pt_br: Descoberta de Serviço

source: DNS Service Discovery, or Zeroconf, is a technology for automatically locating available services on a network. Zeroconf allows users to access network resources without having to provide explicit addresses or configure their applications manually.
pt_br: A Descoberta de Serviço DNS, ou Zeroconf, é uma tecnologia de localização automática de serviços disponíveis na rede. Zeroconf permite aos usuários acessarem os recursos de rede sem ter que fornecer endereços explícitos ou configurar suas aplicações manualmente.

source: DNS Service Discovery is already used in numerous places throughout GNOME, and further support will be added in the future. For example, <application>Nautilus</application>, the GNOME file manager, uses DNS Service Discovery to locate various file servers on the local network. <application>Ekiga</application>, the videoconferencing and telephony application in GNOME, can locate and publish the user's presence and locate other users on a local network using DNS Service Discovery.
pt_br: A Descoberta de serviço DNS já é usado em muitos lugares dentro do GNOME e será adicionado no futuro mais suporte. Por exemplo, o <application>Nautilus</application>, gerenciador de arquivos do GNOME, usa a Descoberta de serviço para localizar vários servidores de arquivo na rede local. O <application>Ekiga</application>, o aplicativo de telefonia e videoconferência do GNOME, pode localizar e publicar a presença do usuário e localizar outros usuários em uma rede local usando a Descoberta de serviço DNS.

source: Full DNS Service Discovery support is provided by the Avahi library. For more information on Avahi, visit <ulink url="http://avahi.org/">the Avahi web site</ulink>.
pt_br: O suporte completo à Descoberta de Serviço DNS é fornecida pela biblioteca Avahi. Para maiores informações sobre o Avahi, visite <ulink url="http://avahi.org/">o site da Avahi</ulink>.

source: XML and Web Services
pt_br: Serviços da Web e XML

source: In our increasingly inter-connected world, more and more applications need to provide support for various web services. Sometimes web services simply provide added functionality, while other times they are the core purpose of the application. Even applications that have been providing a standalone user experience for years have found innovative new uses for web services.
pt_br: Em nosso mundo cada vez mais inter-conectado, mais e mais aplicativos precisam prover suporte para vários serviços de web. Algumas vezes serviços de web simplesmente adicionam uma funcionalidade, enquanto outras vezes eles são o principal propósito do aplicativo. Até aplicativos que têm fornecido uma experiência de usuário standalone por anos, têm encontrado novos usos inovadores para serviços de web.

source: The GNOME Platform provides support for using web services from within your application, as well as comprehensive libraries for consuming, managing, and transforming XML, the language of the web.
pt_br: A Plataforma GNOME oferece suporte para usar serviços de web a partir do interior do seu aplicativo, bem como bibliotecas abrangentes para consumir, armazenar e transformar XML, a linguagem da rede.

source: With the libsoup library, GNOME provides support for the SOAP, a widely-used protocol for passing XML messages over HTTP. SOAP allows developers to expose an interface over the web, which can then be used by applications to retrieve information, send data, make transactions, or use any number of other services provided.
pt_br: Com a biblioteca libsoup, o GNOME fornece suporte para o SOAP, um protocolo amplamente utilizado para transmitir mensagens XML sobre HTTP. SOAP permite que desenvolvedores exponham uma interface sobre a web, que podem então serem utilizadas por aplicativos para recuperar informações, enviar dados, fazer transações ou usar qualquer número de outros serviços fornecidos.

source: SOAP can be used to search and retrieve information, to interact with an online store, to manage users' accounts on other systems, or for many other purposes. Web services are being used more and more to provide essential functionality for users, and applications using SOAP can provide a more integrated and featureful user experience.
pt_br: SOAP pode ser usado para pesquisar e recuperar informações, para interagir com uma loja virtual, para gerenciar contas de usuários em outros sistemas ou para muitos outros propósitos. Serviços de Web estão sendo utilizados cada vez mais usados para fornecer funcionalidades essenciais para os usuários e aplicativos usando SOAP podem prover uma experiência de usuário mais integrada e característica.

source: The libsoup library contains an HTTP implementation and a set of API for constructing and consuming SOAP messages. It also allows for secure authentication, so you can use web services to access private accounts over a secure connection. Using libsoup makes it easy to use web services without manually parsing and interpreting the messages sent through SOAP.
pt_br: A biblioteca libsoup contém uma implementação HTTP e um conjunto de APIs para construir e consumir mensagens SOAP. Isto também é permitido para autenticação segura, desta forma você pode usar serviços de web para acessar contas privadas sobre uma conexão segura. Ao usar libsoup os serviços de web se tornam mais fáceis sem ter que manualmente analisar e interpretar as mensagens enviadas através do SOAP.

source: For more information on libsoup, see the <ulink url="http://library.gnome.org/devel/libsoup/stable/">libsoup Reference Manual</ulink>.
pt_br: Para maiores informações sobre o libsoup, consulte o <ulink url="http://library.gnome.org/devel/libsoup/stable/">Manual de referência do libsoup </ulink>.

source: XML Processing
pt_br: Processamento XML

source: Since its formal introduction in 1998, XML (eXtensible Markup Langauge) has been used in increasingly more applications. It is used for a wide variety of purposes, from document formats like XHMTL and DocBook to internet protocols like SOAP and Jabber. XML provides a clean and simple base syntax, allowing applications to focus on their particular needs.
pt_br: Desde a sua formal introdução em 1998, o XML (eXtensible Markup Language) tem sido cada vez mais utilizado em aplicativos. Ele é usado para uma ampla variedade de propósitos, desde formatos de documentos como XHMTL e DocBook até protocolos de internet como SOAP e Jabber. O XML oferece uma sintaxe de estrutura simples e clara, permitindo que aplicativos possam focar em suas necessidades particulares.

source: GNOME ships with the libxml2 library, and uses it extensively throughout the desktop. The libxml2 library is a fast and fully standards-compliant XML processing library, providing everything you need to use XML in your application.
pt_br: O GNOME vem junto com a biblioteca libxml2 e a utiliza extensivamente por toda a área de trabalho. A biblioteca libxml2 é uma biblioteca de processamento rápida e que atende completamente os padrões de compatibilidade XML, fornecendo qualquer coisa que você precise para usar XML em seus aplicativos.

source: The libxml2 library provides a number of different APIs for working with XML, so you can use whatever best suits your application development needs. In addition to a native tree API, libxml2 also provides the callback-based SAX2 API, streaming XML reader and writer interfaces, and complete support for XPath.
pt_br: A biblioteca libxml2 oferece uma série de diferentes APIs para trabalhar com XML, desse modo você pode usar qualquer coisa que melhor atenda suas necessidades de desenvolvimento de aplicativos. Além de uma API de árvore nativa, o libxml2 também fornece uma API SAX2 baseada em retorno de chamada, leitor de stream XML, escrita de interfaces e suporte completo para XPath.

source: In addition to DTD support, libxml2 also provides full support for validing documents using RELAX NG, which allows a more flexible validation model while remaining simple to use. There is also partial support for XML Schema, the new schema language produced by W3C.
pt_br: Além do suporte a DTD, libxml2 também fornece suporte completo para validação de documentos usando o RELAX NG, que permite um modelo de validação mais flexível enquanto permanece fácil de usar. Também há suporte parcial para esquema XML, a nova linguagem de esquema produzida pela W3C.

source: You should use libxml2 whenever you need to work directly with XML in your application. Using libxml2 ensures that you have fully standards-compliant parsing, processing, and XML output. This means developers can stop worrying about incompatibilities between applications.
pt_br: Você deve utilizar o libxml2 sempre que você precisar trabalhar diretamente com XML no seu aplicativo. Utilizar o libxml2 garante que você terá padrões completos de compatibilidade, análise, processamento e saída XML. Isto significa que desenvolvedores podem parar de se preocupar sobre incompatibilidades entre aplicativos.

source: For more information on libxml2, see <ulink url="http://xmlsoft.org/tutorial/index.html">The Libxml Tutorial</ulink> and <ulink url="http://xmlsoft.org/html/libxml-lib.html">The Reference Manual for libxml2</ulink>.
pt_br: Para maiores informações sobre o libxml2, consulte <ulink url="http://xmlsoft.org/tutorial/index.html">O tutorial do Libxml</ulink> e <ulink url="http://xmlsoft.org/html/libxml-lib.html">O manual de referência do libxml2</ulink>.

source: Transforming XML with XSLT
pt_br: Transformando XML com o XSLT

source: XSLT is an XML-based language for transforming XML into other formats. XSLT is a template-based language, allowing you to match particular types of XML elements and create output accordingly. Based on XML and XPath, XSLT enables developers to create clean and modularized templates to convert an XML dialect into another format more suitable for the application.
pt_br: O XSLT é uma linguagem baseada em XML para transformar XML em outros formatos. XSLT é uma linguagem baseada em modelos, que lhe permite combinar tipos particulares de elementos XML e criar saídas adequadamente. Baseado em XML e XPath, o XSLT permite que os desenvolvedores criem modelos claros e modularizados para converter um dialeto XML em outro formato mais adequado para o aplicativo.

source: GNOME ships with the libxslt library, a complete implementation of XSLT. The libxslt library is built on top of the XML and XPath support in libxml2, allowing it to be fast and fully standards-compliant.
pt_br: GNOME vem junto com a biblioteca libxslt, uma implementação completa do XSLT. A biblioteca libxslt foi construída sobre suporte XML e XPath no libxml2, permitindo que ela seja rápida e completamente compatível com os padrões.

source: You should use libxslt if you need to transform XML documents. Although XSLT is not always the right solution for XML processing, it can often simplify development. Since libxslt allows you to add extension elements and extension functions, you can customize it to fit your application.
pt_br: Você deve usar libxslt se você quiser transformar documentos XML. Apesar do XSLT não ser sempre a solução correta para processamento XML, ele pode freqüentemente simplificar o desenvolvimento. Já que o libxslt permite que você adicione elementos e funções de extensão, você pode customizá-lo para se ajustar no seu aplicativo.

source: For more information on libxslt, see <ulink url="http://xmlsoft.org/XSLT/html/index.html">The XSLT C library for Gnome</ulink>.
pt_br: Para maiores informações sobre o libxslt, consulte a <ulink url="http://xmlsoft.org/XSLT/html/index.html">Biblioteca XSLT C para Gnome</ulink>.

source: Introduction
pt_br: Introdução

source: GNOME is a powerful but simple desktop environment with a strong focus on usability, accessibility, and internationalization. GNOME is designed to be usable by everybody, regardless of technical expertise, disabilitites, or native language. GNOME makes it easy for people to use their computers.
pt_br: O GNOME é um ambiente de trabalho poderoso mas simples com um forte foco em usabilidade, acessibilidade e internacionalização. O GNOME foi projetado para ser utilizável por qualquer um, independentemente de experiência técnica, deficiências ou idioma nativo. O GNOME torna mais fácil o uso de computadores por pessoas.

source: GNOME provides a comprehensive developer platform that allow developers to create professional software that is easy to use and aesthetically pleasing. This document provides a high-level overview of the GNOME platform along with links to detailed documentation on each part of the platform.
pt_br: O GNOME oferece uma plataforma de desenvolvimento abrangente que permite aos desenvolvedores criarem softwares profissionais que são fáceis de usar e esteticamente agradáveis. Este documento oferece uma visão geral de alto nível da plataforma GNOME juntamente com links para documentações detalhadas em cada parte da plataforma.

source: Who Should Read This Document
pt_br: Quem deveria ler este documento

source: You should read this document if you want to create software using the GNOME platform. Developing with the GNOME platform will help you create consistent applications that integrate well into the user's desktop. This guide will introduce you to the various components of the platform, so you know which libraries can accomplish which tasks. This guide links to additional detailed documentation, so you can explore each component of the platform in more depth.
pt_br: Você deve ler este documento se você quiser criar software usando a plataforma GNOME. Desenvolver na plataforma GNOME lhe ajudará a criar aplicativos consistentes que se integram bem na área de trabalho dos usuários. Este guia irá lhe apresentar aos vários componentes da plataforma, assim você saberá quais bibliotecas podem efetuar quais tarefas. Este guia vincula documentações adicionais detalhadas, para deste modo você poder explorar cada componente da plataforma mais profundamente.

source: This guide will also be useful if you are picking a development platform for your software project. It will provide an overview how you can use the GNOME platform to build useful software.
pt_br: Este guia também será útil se você estiver escolhendo uma plataforma de desenvolvimento para o seu projeto de software. Ele irá fornecer uma visão geral de como você pode usar a plataforma GNOME para construir um software útil.

source: This guide also describes ways of extending the GNOME desktop with plugins, panel applets, and other useful tools. If you want to develop additional functionality to plug into the GNOME desktop, you should read this guide, particularly <xref linkend="desktop-tech"/>.
pt_br: Este guia também descreve formas de estender a área de trabalho GNOME com plug-ins, miniaplicativos de painel e outras ferramentas úteis. Se você precisar desenvolver funcionalidades adicionais para plugar na área de trabalho GNOME, você deverá ler este guia, em especial a seção: <xref linkend="desktop-tech"/>.
