Repository: Kr0mAgn0n/gnome-devel-docs
Catalog: platform-overview/*/*.po
Languages: pt_br

source: In addition to basic widgets, such as buttons, check boxes, and text entries, GTK+ also provides powerful Model-View-Controller (MVC) APIs for tree views, multi-line text fields, and menu and toolbar actions.
pt_br: Além dos widgets básicos como botões, caixas de seleção e entradas de texto, o GTK+ também oferece potentes APIs com MVC (controlador de modelo de visualização) para visualizações em árvore, campos de texto com múltiplas linhas e ações de menu e barra de tarefas.

source: Widgets in GTK+ are placed on windows using a box-packing model. Programmers specify only how to pack widgets together in container boxes, rather than position them directly with absolute coordinates. GTK+ ensures that windows are sized correctly to fit their contents, and it automatically handles window resizing.
pt_br: Os widgets no GTK+ são colocados nas janelas usando um modelo de empacotamento de caixas. Os programadores apenas especificam como empacotar os widgets juntos em caixas de container, ao invés de posicioná-las diretamente com coordenadas absolutas. O GTK+ certifica-se de que as janelas estão do tamanho certo para ajustar seus conteúdos e isto automaticamente manipula redimensionamento de janelas.

source: Because GTK+ offers a flexible API, developing additional widgets for use in GTK+ applications is easy. A number of third-party libraries exist which provide additional widgets, and many developers have created custom, special-purpose widgets for their applications.
pt_br: Pelo fato do GTK+ oferecer uma API flexível, o desenvolvimento de widgets adicionais para usar em aplicativos GTK+ é moleza. Existe uma série de bibliotecas de terceiros que oferecem widgets adicionais e muitos desenvolvedores têm criado widgets customizados com propósitos especiais para seus aplicativos.

source: GTK+ handles the difficult details of user interfaces and user interaction, and provides a simple yet powerful API which allows you to focus on the details of your application. Applications developed with GTK+ will automatically follow the user's theme and font settings, will interact properly with accessibility technologies, and will behave as users expect.
pt_br: GTK+ manipula os detalhes problemáticos (difíceis) das interfaces e interação de usuários e fornece uma API potente ainda que simples, que lhe permite focar nos detalhes do seu aplicativo. Os aplicativos desenvolvidos com o GTK+ seguirão automaticamente o tema do usuário e configurações de fonte, irão interagir convenientemente com tecnologias de acessibilidade e irão se comportar como os usuários esperam.

source: For more information on GTK+, see the <ulink url="http://library.gnome.org/devel/gtk/stable/">GTK+ Reference Manual</ulink> or visit <ulink url="http://gtk.org/">the GTK+ web site</ulink>.
pt_br: Para maiores informações sobre GTK+, consulte o <ulink url="http://library.gnome.org/devel/gtk/stable/">Manual de referência GTK+</ulink> ou visite <ulink url="http://gtk.org/">o site do GTK+</ulink>.

source: Libglade is a library for constructing user interfaces dynamically from XML descriptions. You can use a graphical interface builder like <application>Glade</application> to construct your user interface, and then import the interface description into your application. This makes it easy to construct complex layouts and adjust layout details.
pt_br: Libglade é uma biblioteca para construção de interfaces de usuário dinamicamente a partir de descrições XML. Você pode usar um construtor de interface gráfica como o <application>Glade</application> para construir sua interface de usuário e depois, importar a descrição da interface em seu aplicativo. Isto facilita a construção de layouts complexos e o ajuste de detalhes do layout.

source: Libglade allows programmers to focus their code on the logic of their applications, keeping it uncluttered by the actual construction of the interface. Graphical interface builders also make it easy for dedicated interface designers to construct the interfaces without having to know how to program.
pt_br: Libglade permite que os programadores foquem seu código na lógica de suas aplicações, mantendo-os organizados pela construção atual da interface. Os construtores de interface gráfica também facilitam que designers de interface dedicados construam as interfaces sim ter de saber como programar.

source: For more information on Libglade, see the <ulink url="http://library.gnome.org/devel/libglade/stable/">Libglade Reference Manual</ulink>.
pt_br: Para maiores informações sobre Libglade, veja o <ulink url="http://library.gnome.org/devel/libglade/stable/">Manual de referência Libglade</ulink>.

source: The Pango layout engine can be used with different font backends and drawing backends. On most GNOME systems, Pango will use FreeType, fontconfig, and Cairo to access fonts and render text. On other systems, Pango will use the native font systems, such as Uniscribe on Microsoft Windows and ATSUI on MacOS
pt_br: O mecanismo de layout Pango pode ser usado com diferentes retaguardas (backends) de fonte e desenho. Na maioria dos sistemas GNOME, o Pango usará o FreeType, fontconfig e o Cairo para acessarem as fontes e renderizarem texto. Em outros sistemas, o Pango utilizará sistemas de fontes nativas, como a Uniscribe no Microsoft Windows e a ATSUI no MacOS.

source: Pango is the core text and font handling library in the GNOME platform. It is responsible for laying out and rendering text, and is used throughout GTK+.<placeholder-1/>
pt_br: Pango é a principal biblioteca de gerenciamento de texto e fonte na plataforma GNOME. É responsável pela disposição e renderização de texto e é utilizado em todo o GTK+.<placeholder-1/>

source: Pango has extensive support for the various writing systems used throughout the world. Many of the writing systems used for languages have complex rules for laying out glyphs and composing characters. With Pango, nearly all languages can be written and displayed correctly, allowing users everywhere to view text in their native languages. Pango support for multiple writing systems is automatic; application developers do not have to write any special code to support other languages.
pt_br: Pango possui suporte extensivo para os vários sistemas de escrita utilizados pelo mundo todo. Muitos dos sistemas de escrita usados por idiomas possuem regras complexas de desenho de glifos e redação de caracteres. Com Pango, quase todos os idiomas podem ser escritos e exibidos corretamente, permitindo que usuários de qualquer lugar visualizem textos em seus idiomas nativos. O suporte do Pango para múltiplos sistemas de escrita é automático; os desenvolvedores de aplicativos não precisam escrever nenhum código especial para suportar outros idiomas.

source: Displaying Multiple Languages With Pango
pt_br: Exibindo múltiplos idiomas com o Pango

source: Screenshot of the <application>gedit</application> text editor displaying phrases from multiple languages and writing systems.
pt_br: Captura de tela do <application>gedit</application> editor de textos exibindo frases de múltiplos idiomas e sistemas de escrita.

source: Pango supports the text styling used in typical documents and interfaces, including italics, font weights, and underlines. Pango uses a simple XML-like vocabulary called PangoMarkup which enables you to set font size, color, styles, and other text attributes. Using PangoMarkup, you can specify inline styles without manually iterating over text blocks. PangoMarkup can be used directly from GTK+, enabling you to style text in your graphical interfaces easily.
pt_br: Pango suporta o estilo de texto usado em típicos documentos e interfaces, incluindo a espessura da fonte, itálico e sublinhado. Pango usa um vocabulário simples semelhante ao XML chamado PangoMarkup, que lhe permite ajustar o tamanho da fonte, cor, estilos e outros atributos de texto. Ao usar PangoMarkup, você pode especificar estilos online sem ter que lidar manualmente com blocos de texto. PangoMarkup pode ser usado diretamente com o GTK+, permitindo a você estilizar textos em suas interfaces gráficas facilmente.

source: You should use Pango directly whenever you need to lay text out on the screen or on a different medium. Using Pango will allow your text layout to work seamlessly with GTK+ and the rest of the GNOME platform. It will help you create portable code, and most importantly, it will ensure that your application can render text correctly in hundreds of different languages.
pt_br: Você deve usar diretamente o Pango toda vez que você precise mostrar o texto na tela ou em um meio diferente. Usar Pango permitirá que o layout do seu texto trabalhe discretamente com o GTK+ e o resto da plataforma GNOME. Isto lhe auxiliará criar código portável e o mais importante, assegurar-lhe-á que seu aplicativo poderá renderizar texto corretamente em centenas de idiomas diferentes.

source: For more information on Pango, see the <ulink url="http://library.gnome.org/devel/pango/stable/">Pango Reference Manual</ulink>.
pt_br: Para maiores informações sobre Pango, consulte o <ulink url="http://library.gnome.org/devel/pango/stable/">Manual de referência Pango</ulink>.

source: GDK runs on a number of different platforms, including the X Window System, Microsoft Windows, DirectFB, and Quartz. On any platform, GDK provides the same consistent API, allowing GTK+ and GTK+ applications to run unmodified.
pt_br: GDK é executada sobre várias plataformas diferentes, incluindo o sistema de Janelas X, o Microsoft Windows, o DirectFB e o Quartz. Em qualquer plataforma, a GDK oferece a mesma API consistente, permitindo que o GTK+ e seus aplicativos sejam executados sem modificações.

source: GDK is the low-level library used by GTK+ to interact with the system for graphics and input devices. Although you will rarely use GDK directly in application code, it contains all the necessary functionality to draw objects and text to the screen and to interact with the user with various input devices.<placeholder-1/>
pt_br: GDK é a biblioteca de baixo nível utilizada pelo GTK+ para interagir com o sistema por gráficos e dispositivos de entrada. Embora raramente você usará diretamente a GDK no código do aplicativo, ela contém todas as funcionalidades necessárias para desenhar objetos e textos na tela e para interagir com o usuário por vários dispositivos de entrada.<placeholder-1/>

source: GDK features a graphics context and drawing primitives that are suitable for drawing simple objects and rendering images on the screen. Since a more extensive drawing system is provided by Cairo, GDK provides hooks to use Cairo contexts within GDK.
pt_br: GDK apresenta um contexto gráfico e primitivas de desenho que são apropriadas para desenhar simples objetos e renderizar imagens na tela. Desde que um sistema de desenho mais extensivo é fornecido pelo Cairo, o GDK oferece ganchos para usar contextos do Cairo dentro do GDK.

source: GDK enables you to access events from keyboards, mice, and other input devices, rather than connect to the high-level signals used in GTK+. GDK also provides low-level routines to access drag and drop and clipboard data from the system. When implementing custom controls, you may need to access these features to implement proper user interaction behavior.
pt_br: GDK permite que você acesse eventos de teclados, mouses e outros dispositivos de entrada, ao invés de conectá-los aos sinais de alto nível utilizados no GTK+. GDK também oferece rotinas de baixo nível para acessar dados do arrastar-e-soltar e da área de transferência do sistema. Quando implementados controles customizados, você poderá precisar acessar esses recursos para implementar um próprio comportamento de interação com o usuário.

source: GDK provides other functionality which is needed to implement a complete graphical toolkit like GTK+. Since GDK acts as a platform abstraction, allowing GTK+ to run under multiple environments, it provides an API for all of the system functionality needed by GTK+. This includes information about multi-head displays, resolution and color depth, colormaps, and cursors.
pt_br: GDK oferece outra funcionalidade que é necessária para a implementação de um kit completo de ferramentas gráficas como o GTK+. Como GDK atua como uma abstração de plataforma, que permite ao GTK+ ser executado em vários ambientes, ele fornece uma API para todas as funcionalidades do sistema que precisem do GTK+. Isto inclui informações sobre exibição de multi-monitores, resolução, profundidade da cor, mapas de cores e cursores.

source: You should use GDK whenever you need low-level access to the underlying windowing system, including low-level access to events, windows, and the clipboard. Using GDK for these tasks ensures that your code is portable and integrates with the rest of your GTK+ code. The simple drawing routines in GDK should generally not be used. Instead, you should use the extensive functionality provide by Cairo.
pt_br: Você deve usar GDK toda vez que precise acesso de baixo nível para o sistema de janelas subjacente, incluindo acesso de baixo nível para eventos, janelas e para a área de transferência. Usar GDK para estas tarefas garante que seu código é portável e integra-se com o resto do seu código GTK+. Geralmente rotinas simples de desenho no GDK não devem ser usadas. Ao invés disso você deve usar a funcionalidade extensiva fornecida pelo Cairo.

source: For more information on GDK, see the <ulink url="http://library.gnome.org/devel/gdk/stable/">GDK Reference Manual</ulink>.
pt_br: Para maiores informações sobre GDK, consulte o <ulink url="http://library.gnome.org/devel/gdk/stable/">Manual de referência GDK</ulink>.

source: Cairo is a 2D graphics library featuring a sophisticated API for drawing vector graphics, compositing images, and rendering anti-aliased text. Cairo provides support for multiple output devices, including the X Window System, Microsoft Windows, and image buffers, allowing you to write platform-independent code to draw graphics on different media.
pt_br: Cairo é uma biblioteca gráfica 2D que apresenta uma sofisticada API para desenhar gráficos vetoriais, combinação de imagens e renderização de texto suavizado (anti-aliase). Cairo fornece suporte para múltiplos dispositivos de saída, incluindo o sistema de janela X, Microsoft Windows, e buffers de imagem, o que lhe permite escrever código independente da plataforma para desenhar gráficos em diferentes mídias.

source: The Cairo drawing model is similar to those provided by PostScript and PDF. The Cairo API provides such drawing operations as stroking and filling cubic Bézier splines, compositing images, and performing affine transformations. These vector operations allow for rich, anti-aliased graphics without using expensive pixel-based drawing in your application code.
pt_br: O modelo de desenho do Cairo é similar aqueles fornecidos por PostScript e por PDF. A API do Cairo fornece tanto operações de desenho como pincelada e preenchimento de splines cúbicos de Bézier, composição de imagens e execucção de transformações semelhantes. Estas operações de vetores permitem gráficos ricos e suaves (anti-aliase) sem ter que usar o dispendioso desenho baseado em píxels no código do seu aplicativo.

source: Cairo's rich drawing model allows for high-quality rendering to multiple media. The same API can be used to create stunning on-screen graphics and text, to render images, or create crisp output suitable for printing.
pt_br: O modelo de desenho rico do Cairo permite renderização de alta qualidade para várias mídias. A mesma API pode ser utilizada para criar sobre a tela impressionantes gráficos e texto, para renderizar imagens ou para criar saídas revigorantes adequadas para impressão.

source: You should use Cairo whenever you need to draw graphics in your application beyond the widgets provided by GTK+. Much of the drawing inside GTK+ is done using Cairo. Using Cairo for your custom drawing will allow your application to have high-quality, anti-aliased, and resolution-independent graphics.
pt_br: Você deve usar Cairo toda vez que precise desenhar gráficos em seu aplicativo além dos widgets fornecidos pelo GTK+. Muitos dos desenhos dentro do GTK+ são feitos usando Cairo. Usar Cairo para o seu desenho personalizado permitirá que sua aplicação tenha gráficos de alta qualidade, suaves (anti-aliase) e de resolução independente.

source: For more information on Cairo, see <ulink url="http://www.cairographics.org/manual/">Cairo: A Vector Graphics Library</ulink>.
pt_br: Para maiores informações sobre Cairo, consulte <ulink url="http://www.cairographics.org/manual/">Cairo: uma biblioteca de vetores gráficos</ulink>.

source: Virtual File System
pt_br: Sistema de Arquivo Virtual (Virtual FIle System)

source: GIO, a part of GLib, is the core library used for file and folder operations in GNOME applications. GIO provides a unified file system abstraction layer with pluggable backends. In GNOME, the GVFS library provides a GIO backend implementing multiple network and local protocols. Using GIO with GVFS allows your application to work with files on remote machines as easily as local files.
pt_br: GIO, uma parte da GLib, é a biblioteca principal usada para operações de arquivos e pastas nos aplicativos GNOME. GIO oferece uma camada de abstração unificada de sistema de arquivos com retaguardas (backends) plugáveis. No GNOME, a biblioteca GVFS oferece uma retaguarda GIO implementando várias redes e protocolos locais. Utilizar GIO com GVFS permite que seu aplicativo trabalhe com arquivos em máquinas remotas tão facilmente quanto os arquivos locais.

source: GIO can provide extensive information about files and folders, including the MIME type and icon of a file and which applications can be used to open a file. Since the GVFS uses the standard from <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink> to determine file types and associations, it works correctly on different free desktop environments, helping independent software developers create software that can be run in different environments.
pt_br: GIO Pode fornecer informações complementares sobre arquivos e pastas, incluindo o tipo MIME, o ícone do arquivo e quais aplicativos podem ser usados para abrir um arquivo. Tendo em vista que o GVFS usa os padrões do <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink> para determinar associações e tipos de arquivos, ele funciona corretamente em diferentes ambientes de trabalho livres, ajudando desenvolvedores de software independentes criarem programas que podem ser executados em diferentes ambientes.

source: GIO is used throughout the GNOME desktop. The file manager, <application>Nautilus</application>, uses GIO to display folders on local and remote systems. For the user, this means that network servers act just like local folders: They can drag and drop files between them, view the files' properties, and open the file with an application. Using GIO will allow your application to open all the files that users can access on their desktop.
pt_br: GIO é usado por toda a área de trabalho GNOME. O gerenciador de arquivos <application>Nautilus</application> usa GIO para exibir pastas em sistemas locais e remotos. Para o usuário, isso significa que servidores de rede atuam como se fossem pastas locais: Eles podem arrastar e soltar arquivos entre eles, visualizar as propriedades dos arquivos e abrir o arquivo com um aplicativo. Usar GIO permitirá que seu aplicativo abra todos os arquivos que usuários podem acessar em suas áreas de trabalho.

source: For more information on GIO, see the <ulink url="http://library.gnome.org/devel/gio/stable/">GIO Reference Manual</ulink>.
pt_br: Para maiores informações sobre GIO, consulte o <ulink url="http://library.gnome.org/devel/gio/stable/">Manual de referência GIO</ulink>.

source: In previous versions of GNOME, the GnomeVFS library was used for access to files and folders. While GnomeVFS provided many of the same features, including transparent access to remote folders, it had a number of limitations which have been addressed in GIO. GnomeVFS is deprecated and should not be used in newly written code, although it will continue to be supported throughout the GNOME 2 lifetime. For information on GnomeVFS, see <ulink url="http://library.gnome.org/devel/gnome-vfs-2.0/stable/">GnomeVFS - Filesystem Abstraction Library</ulink>.
pt_br: Em versões anteriores do GNOME, a biblioteca GnomeVFS era usada para acessar arquivos e pastas. Enquanto a GnomeVFS oferecia muitas das mesmas características, incluindo acesso transparente a pastas remotas, ela tinha uma porção de limitações que foram levadas pelo GIO. GnomeVFS é obsoleta e não deve ser utilizada em códigos recém escritos, apesar dela continuar sendo suportada durante o ciclo de vida do GNOME 2. Para informações sobre GnomeVFS, consulte a <ulink url="http://library.gnome.org/devel/gnome-vfs-2.0/stable/">Biblioteca de abstração de sistema de arquivos - GnomeVFS</ulink>.

source: Configuration and Lockdown
pt_br: Configurações e Bloqueio

source: GConf is the system for storing and retrieving configuration settings in GNOME. GConf consists of two parts: a client library for accessing settings, and a session daemon which is responsible for the details of storing and retrieving those settings. Using a daemon allows GConf to use different storage backends, validate input, and provide simultaneous access to different applications.
pt_br: GConf é o sistema de armazenamento e recuperação ajustes de configuração no GNOME. GConf consiste de duas partes: uma biblioteca cliente para acessar as configurações e um daemon de sessão que é responsável pelos detalhes de armazenamento e recuperação estes ajustes. Usar um daemon permite que o GConf use diferentes retaguardas (backends) de armazenamento, valide entradas e ofereça acesso simultâneo a diversos aplicativos.

source: Settings stored in GConf are stored and retrieved using a unique key, or identifier string. Keys use a simple hierarchical namespace to avoid collision among settings for applications and the desktop. You can provide a schema file to detail your configuration keys. This allows GConf to validate the type of the input, and to show localized documentation about the key. This helps systems administrators, who can set multiple settings at once without having to navigate preference dialogs.
pt_br: Os ajustes armazenados no GConf são armazenados e recuperados através de uma única chave ou string de identificação. As chaves utilizam um simples espaço de nome hierárquico para evitar colisões entre ajustes para aplicativos e para a área de trabalho. Você pode fornecer um arquivo de esquema para detalhar suas chaves de configuração. Isto permite que o GConf valide o tipo de entrada e para mostrar documentação localizada sobre a chave. Isto ajuda os adminsitradores de sistemas, que podem ajustar múltiplas configurações de uma vez só sem ter que navegar pelas janelas de diálogo de preferências.
