Repository: Kr0mAgn0n/gnome-devel-docs
Catalog: platform-overview/*/*.po
Languages: pt_br

source: The gtkhtml library provides a lightweight HTML renderer with full support for rich text editing. It is used inside the <application>Evolution</application> mailer to allow users to compose and read HTML email.
pt_br: A biblioteca gtkhtml oferece um renderizador HTML suave com suporte completo à edição de texto rico. Ela é usada dentro do cliente de e-mail <application>Evolution</application> para permitir que usuários redijam e leiam e-mails HTML.

source: The gtksourceview library provides an extension of the GtkTextView widget with support for automatic syntax highlighting and other functions that are useful for source code editors. It is used in the <application>gedit</application> text editor.
pt_br: A biblioteca gtksourceview oferece uma extensão do widget GtkTextView com suporte para destacamento (realce) automático de sintaxe e outras funções úteis para editores de código fonte. Isto é usado no editor de textos <application>gedit</application>.

source: GAIL provides an implementation of the ATK interfaces for GTK+ and GNOME libraries, allowing accessibility tools to interact with applications written using these libraries. Accessibility is discussed in <xref linkend="a11y"/>.
pt_br: GAIL fornece uma implementação das interfaces ATK para GTK+ e bibliotecas GNOME, permitindo que ferramentas de acessibilidade interajam com aplicativos escritos utilizando essas bibliotecas. Acessibilidade é discutida em <xref linkend="a11y"/>

source: libgnomeprint is a deprecated library that provides an implementation of the PostScript imaging model. It is superseded by <ulink url="http://library.gnome.org/devel/gtk/stable/Printing.html">GtkPrint</ulink>. Newly written code should use GtkPrint instead. The GNOME print framework is discussed in <xref linkend="gnomeprint"/>.
pt_br: A obsoleta biblioteca libgnomeprint oferece uma implementação do modelo de imagem PostScript e pode ser utilizada para criar renderizações de impressão de alta qualidade. O framework de impressão do GNOME é discutido em <xref linkend="gnomeprint"/>.

source: libgnomeprintui is a deprecated library that provides a standard print dialog, a print preview dialog, and various other controls required for printing. It is superseded by <ulink url="http://library.gnome.org/devel/gtk/stable/Printing.html">GtkPrint</ulink>. The GNOME print framework is discussed in <xref linkend="gnomeprint"/>.
pt_br: A obsoleta bilbioteca libgnomeprintui oferece uma janela de diálogo de impressão padrão, uma de pré-visualização de impressão e vários outros controles requeridos para impressão. O framework de impressão do GNOME é discutido em <xref linkend="gnomeprint"/>.

source: The libgtop library provides a portable API for obtaining information about running processes. It is used in the <application>System Monitor</application> application.
pt_br: A bilbioteca libgtop oferece uma API portátil para obter informações sobre processos em execução. Ela é usada no aplicativo <application>Monitor do sistema</application>.

source: The librsvg library provides an implementation of Scalable Vector Graphics (SVG). It is used throughout the desktop to render resolution-independent vector graphics.
pt_br: A biblioteca librsvg oferece uma implementação de gráficos de vetores escaláveis (SVG). Ela é usada por toda a área de trabalho para renderizar gráficos vetoriais de resolução independente.

source: The libsoup library provides an implementation of the Simple Object Access Protocol (SOAP), as well as an HTTP implementation. SOAP can be used to build web services into applications. The libsoup library is discussed in <xref linkend="libsoup"/>.
pt_br: A biblioteca libsoup oferece uma implementação do protocolo de acesso simples ao objeto (SOAP), bem como uma implementação HTTP. SOAP pode ser usado para construir web services dentro de aplicativos. A biblioteca libsoup é discutida em <xref linkend="libsoup"/>.

source: The libwnck library provides a means of controlling any EWMH-compliant window manager, including <application>Metacity</application>, the GNOME default window manager. The libwnck library is discussed in <xref linkend="window-manager"/>.
pt_br: A biblioteca libwnck fornece meios para controlar qualquer gerenciador de janelas EWMH-compatível, incluindo o <application>Metacity</application>, o gerenciador de janelas padrão do GNOME. A biblioteca libwnck é discutida em <xref linkend="window-manager"/>.

source: The libxklavier library provides a high-level API for accessing and setting keyboard layouts. It is used in the <application>Keyboard Preferences</application> to allow users to set their keyboard layout and options.
pt_br: A biblioteca libxklavier fornece uma API de alto nível para acessar e ajustar os layouts do teclado. Ela é usada em <application>Preferências do teclado</application> para permitir que os usuários possam definir suas opções e layout do teclado.

source: VTE is a terminal emulator widget for use in GTK+ applications. It provides a consistent API and uses Pango for text drawing, allowing it to display all internationalized text. VTE is used in GNOME's <application>Terminal</application> application.
pt_br: VTE é um widget emulador de terminal para ser utilizado em aplicativos GTK+. Ele fornece uma API consistente e usa o Pango para desenhar textos, permitindo que sejam exibidos todos os textos internacionalizados, VTE é utilizado no aplicativo <application>Terminal</application> do GNOME.

source: Overview of the GNOME Platform
pt_br: Visão geral da plataforma GNOME

source: GNOME Foundation
pt_br: Fundação GNOME

source: Overview of the powerful technologies inside the GNOME platform.
pt_br: Visão geral das poderosas tecnologias dentro da plataforma GNOME.

source: GNOME Documentation Project
pt_br: Projeto de documentação GNOME

source: translator-credits
pt_br: Enrico Nicoletto <liverig@gmail.com>, 2009.
