Repository: Kr0mAgn0n/gnome-devel-docs
Catalog: platform-overview/*/*.po
Languages: pt_br

source: Platform Overview
pt_br: Visão geral da plataforma

source: The GNOME platform provides a comprehensive development environment for graphical applications and other software. Using the technologies in GNOME, you can create high-quality software to meet and exceed your users' expectations. This chapter provides a very brief overview of the components that are discussed in this document.
pt_br: A plataforma GNOME oferece um ambiente de desenvolvimento abrangente para aplicações gráficas e outros softwares. Usando as tecnologias do GNOME, você pode criar software de alta qualidade para satisfazer e superar às expectativas dos usuários. Este capítulo fornece um breve panorama dos componentes que são discutidos neste documento.

source: Core Technologies
pt_br: Tecnologias essenciais

source: GNOME provides a number of libraries for constructing attractive graphical interfaces. It provides libraries for displaying and manipulating common user interface controls, for laying out and rendering text from most of the world's writing systems, and for drawing sophisticated vector graphics to the screen. The graphical technologies in GNOME are outlined in <xref linkend="graphics"/>.
pt_br: O GNOME oferece um número de bibliotecas para construir interfaces gráficas atraentes. Fornece bibliotecas para exibir e manipular controles comuns de interface de usuário, para dispôr e renderizar textos da maioria dos sistemas de escrita do mundo, e para desenhar sofisticados gráficos vetoriais na tela. As tecnologias gráficas do GNOME são destacadas em <xref linkend="graphics"/>.

source: The GIO library in GLib, together with the GVFS backend, provides a file system abstraction that allows users to work with files on remote servers as well as the local file systems. GIO provides a high-level API for file operations, making development fast and easy. Using GIO will allow your application to support remote files and folders automatically. GIO and GVFS are discussed in <xref linkend="gio"/>.
pt_br: A biblioteca GIO no GLib, junto com a retaguarda (backend) do GVFS, fornecem uma abstração de sistemas de arquivos que permite aos usuários trabalharem com arquivos em servidores remotos assim como em sistemas de arquivos local. O GIO fornece uma API de alto nível para operações de arquivo, fazendo que o desenvolvimento seja rápido e fácil. Usando o GIO será permitido o suporte a pastas e arquivos remotos automaticamente no seu aplicativo. O GIO e o GVFS são discutidos em <xref linkend="gio"/>.

source: GNOME provides the GConf library and daemon for storing and retrieving user preferences. GConf has a simple API that makes it easy to provide instant-apply preferences in your application. Using GConf also allows administrators to provide default and mandatory application settings for their users. GConf is discussed in <xref linkend="gconf"/>.
pt_br: O GNOME fornece a biblioteca e o daemon do GConf para armazenar e recuperar as preferências do usuário. O GConf possui uma API simples que facilita o fornecimento de preferências de aplicação instantânea nos seus aplicativos. GConf também permite aos administradores fornecerem as configurações padrões ou obrigatórias para seus usuários. GConf é discutido em <xref linkend="gconf"/>.

source: GNOME provides facilities for internationalization and accessibility, helping you reach the largest possible number of potential users. Much of the internationalization and accessibility support is built right in, but there are many issues you should be aware of when developing applications. Internationalization is discussed in <xref linkend="i18n"/>. Accessibility is discussed in <xref linkend="a11y"/>.
pt_br: O GNOME oferece motores para internacionalização e accessibilidade, ajudando-lhe a alcançar o maior número possível de potenciais usuários. Grande parte do suporte à internacionalização e acessibilidade é integrada, contudo há muitas questões que você deve estar ciente quando desenvolve aplicativos. A internacionalização é discutida em <xref linkend="i18n"/>. A acessibilidade é discutida em <xref linkend="a11y"/>.

source: GNOME ships with GStreamer, an extremely powerful multimedia framework for creating, editing, and playing audio and video content. GStreamer is discussed in <xref linkend="multimedia"/>.
pt_br: O GNOME vem junto com o GStreamer, um framework multimídia extremamente poderoso para criação, edição e execução de conteúdo de áudio e vídeo. O GStreamer é discutido em <xref linkend="multimedia"/>.

source: GNOME also provides a complete print framework which leverages CUPS whenever possible. The print framework in GNOME allows you to provide a consistent interface to high-quality printing. The print framework is discussed in <xref linkend="printing"/>.
pt_br: GNOME também fornece um completo framework de impressão que potencializa o CUPS sempre que possível. O framework de impressão no GNOME permite a você fornecer uma interface consistente para impressões de alta qualidade. O framework de impressão é discutido em <xref linkend="printing"/>.

source: IPC and Networking
pt_br: IPC e Rede

source: The GNOME desktop has full support for transferring data using the clipboard or with drag and drop. The APIs in GTK+ can help you create applications that interoperate well with the rest of the desktop. Clipboard and drag and drop functionality are discussed in <xref linkend="clipboard"/>.
pt_br: A área de trabalho GNOME possui suporte completo para transferência de dados usando a área de transferência ou com o arrastar-e-soltar. As APIs no GTK+ podem ajudá-lo(a) a criar aplicativos que possuem boa interoperabilidade com o resto da área de trabalho. As funcionalidades da área de transferência e do arrastar-e-soltar são discutidas em <xref linkend="clipboard"/>.

source: With <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink>, GNOME provides the D-Bus messaging system. D-Bus is a cross-desktop message bus which allows all types of applications to communicate with one another. D-Bus is discussed in <xref linkend="dbus"/>.
pt_br: Com o <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink>, o GNOME oferece o sistema de mensagens D-Bus. D-Bus é um barramento de mensagens entre várias áreas de trabalho que permite a comunicação de todos os tipos de aplicativos entre si. O D-Bus é discutido em <xref linkend="dbus"/>.

source: GNOME features the Bonobo component system, built on top of CORBA. Bonobo allows programmers to create complex embeddable components which can be reused inside other programs. Note that Bonobo has been deprecated. Newly written code should use D-Bus and other technologies instead. Bonobo is discussed in <xref linkend="bonobo-corba"/>.
pt_br: O GNOME apresenta o sistema de componentes Bonobo, construído em cima do CORBA. O Bonobo permite aos desenvolvedores criarem complexos componentes incorporados que podem ser reutilizados dentro de outros programas. O Bonobo é discutido em <xref linkend="bonobo-corba"/>.

source: To make networks more manageable for users, GNOME supports DNS Service Discovery. DNS Service Discovery enables applications to find services automatically on a local network, rather than requiring users to provide network addresses. DNS Service Discovery is discussed in <xref linkend="dns-sd"/>.
pt_br: Para fazer redes mais gerenciáveis para usuários, o GNOME suporta Descoberta de Serviço DNS. A Descoberta de Serviço DNS habilita os aplicativos a pesquisarem serviços automaticamente em uma rede local, ao invés de requerer aos usuários o fornecimento dos endereços de rede. A Descoberta de Serviço DNS é debatida em <xref linkend="dns-sd"/>.

source: Finally, GNOME provides a number of libraries for working with XML and web services. These technologies are becoming increasingly important to application developers. XML and web services are discussed in <xref linkend="xml-web-services"/>.
pt_br: Finalmente o GNOME oferece um número de bibliotecas para trabalhar com XML e serviços web. Estas tecnologias estão se tornando cada vez mais importantes para os desenvolvedores de aplicativos. XML e web services são discutidos em <xref linkend="xml-web-services"/>.

source: Desktop Technologies
pt_br: Tecnologias da área de trabalho

source: The GNOME desktop features numerous places where applications can provide better integration, such as providing panel applets or plugins for the file manager. Many of these features are discussed in <xref linkend="desktop-tech"/>.
pt_br: A área de trabalho GNOME apresenta muitos lugares onde aplicativos podem prover uma melhor integração, assim como os miniaplicativos de painel ou plug-ins para o gerenciamento de arquivos. Muitas destas características são discutidas em <xref linkend="desktop-tech"/>.

source: GNOME provides comprehensive Human Interface Guidelines to help you create more usable applications. GNOME's usability standards were a first among free desktop environments, and they continue to improve through GNOME's commitment to a better user experience. Usability is discussed in <xref linkend="usability"/>.
pt_br: O GNOME apresenta um abrangente guia de diretrizes de interface humana para auxiliá-lo a criar aplicativos mais utilizáveis. Os padrões de usabilidade GNOME foram os primeiros dentre os ambientes de trabalho livre e eles continuam melhorando graças ao empenho do GNOME em trazer uma melhor experiência ao usuário. A usabilidade é discutida em <xref linkend="usability"/>.

source: GNOME also provides a complete help system, as well as style guidelines for writing documentation. Though often under-appreciated, good user help can significantly improve your software. Documentation is discussed in <xref linkend="documentation"/>.
pt_br: GNOME também oferece um completo sistema de ajuda, bem como guias de estilo para escrever documentações. Apesar de comumente ser subestimada, uma boa ajuda de usuário pode melhorar significativamente seu software. A documentação é discutida em <xref linkend="documentation"/>.

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License (GFDL), Version 1.1 or any later version published by the Free Software Foundation with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. You can find a copy of the GFDL at this <ulink url="ghelp:fdl">link</ulink> or in the file COPYING-DOCS distributed with this manual.
pt_br: Permissão concedida para copiar, distribuir e/ou modificar este documento sob os termos da Licença de Documentação Livre GNU (GNU Free Documentation License), Versão 1.1 ou qualquer versão mais recente publicada pela Free Software Foundation; sem Seções Invariantes, Textos de Capa Frontal, e sem Textos de Contracapa. Você pode encontrar uma cópia da licença GFDL no <ulink url="ghelp:fdl">link</ulink> ou no arquivo COPYING-DOCS distribuído com este manual.

source: This manual is part of a collection of GNOME manuals distributed under the GFDL. If you want to distribute this manual separately from the collection, you can do so by adding a copy of the license to the manual, as described in section 6 of the license.
pt_br: Este manual é parte da coleção de manuais do GNOME distribuídos sob a GFDL. Se você quiser distribuí-lo separadamente da coleção, você pode fazê-lo adicionando ao manual uma cópia da licença, como descrito na seção 6 da licença.

source: Many of the names used by companies to distinguish their products and services are claimed as trademarks. Where those names appear in any GNOME documentation, and the members of the GNOME Documentation Project are made aware of those trademarks, then the names are in capital letters or initial capital letters.
pt_br: Muitos dos nomes usados por empresas para distinguir seus produtos e serviços são reivindicados como marcas registradas. Onde esses nomes aparecem em qualquer documentação do GNOME e os membros do Projeto de Documentação do GNOME estiverem cientes dessas marcas registradas, os nomes aparecerão impressos em letras maiúsculas ou com iniciais em maiúsculas.

source: DOCUMENT IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS FREE OF DEFECTS MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY, ACCURACY, AND PERFORMANCE OF THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS WITH YOU. SHOULD ANY DOCUMENT OR MODIFIED VERSION PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL WRITER, AUTHOR OR ANY CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER; AND
pt_br: O DOCUMENTO É FORNECIDO NA BASE "COMO ESTÁ", SEM GARANTIAS DE QUALQUER TIPO, TANTO EXPRESSA OU IMPLÍCITA, INCLUINDO, MAS NÃO LIMITADO A, GARANTIAS DE QUE O DOCUMENTO OU VERSÃO MODIFICADA DO DOCUMENTO SEJA COMERCIALIZÁVEL, LIVRE DE DEFEITOS, PRÓPRIO PARA UM PROPÓSITO ESPECÍFICO OU SEM INFRAÇÕES. TODO O RISCO A RESPEITO DA QUALIDADE, EXATIDÃO, E DESEMPENHO DO DOCUMENTO OU VERSÕES MODIFICADAS DO DOCUMENTO É DE SUA RESPONSABILIDADE. SE ALGUM DOCUMENTO OU VERSÃO MODIFICADA SE PROVAR DEFEITUOSO EM QUALQUER ASPECTO, VOCÊ (NÃO O ESCRITOR INICIAL, AUTOR OU QUALQUER CONTRIBUIDOR) ASSUME O CUSTO DE QUALQUER SERVIÇO NECESSÁRIO, REPARO OU CORREÇÃO. ESSA RENÚNCIA DE GARANTIAS CONSTITUI UMA PARTE ESSENCIAL DESTA LICENÇA. NENHUM USO DESTE DOCUMENTO OU VERSÃO MODIFICADA DESTE DOCUMENTO É AUTORIZADO SE NÃO FOR SOB ESSA RENÚNCIA; E

source: UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER IN TORT (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL THE AUTHOR, INITIAL WRITER, ANY CONTRIBUTOR, OR ANY DISTRIBUTOR OF THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO ANY PERSON FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER DAMAGES OR LOSSES ARISING OUT OF OR RELATING TO USE OF THE DOCUMENT AND MODIFIED VERSIONS OF THE DOCUMENT, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES.
pt_br: SOB NENHUMA CIRCUNSTÂNCIA E SOB NENHUMA TEORIA LEGAL, TANTO EM DANO (INCLUINDO NEGLIGÊNCIA), CONTRATO, OU OUTROS, DEVEM O AUTOR, ESCRITOR INICIAL, QUALQUER CONTRIBUIDOR, OU QUALQUER DISTRIBUIDOR DO DOCUMENTO OU VERSÃO MODIFICADA DO DOCUMENTO, OU QUALQUER FORNECEDOR DE ALGUMA DESSAS PARTES, SER CONSIDERADOS RESPONSÁVEIS A QUALQUER PESSOA POR QUALQUER DANO, SEJA DIRETO, INDIRETO, ESPECIAL, ACIDENTAL OU CONSEQÜENCIAL DE QUALQUER INDIVÍDUO, INCLUINDO, MAS NÃO LIMITADO A, DANOS POR PERDA DE BOA VONTADE, TRABALHO PARADO, FALHA OU MAU FUNCIONAMENTO DO COMPUTADOR, OU QUALQUER E TODOS OS OUTROS DANOS OU PERDAS RESULTANTES OU RELACIONADOS AO USO DO DOCUMENTO E VERSÕES MODIFICADAS, MESMO QUE TAL PARTE TENHA SIDO INFORMADA DA POSSIBILIDADE DE TAIS DANOS.

source: DOCUMENT AND MODIFIED VERSIONS OF THE DOCUMENT ARE PROVIDED UNDER THE TERMS OF THE GNU FREE DOCUMENTATION LICENSE WITH THE FURTHER UNDERSTANDING THAT: <placeholder-1/>
pt_br: O DOCUMENTO E VERSÕES MODIFICADAS DO DOCUMENTO SÃO FORNECIDOS SOB OS TERMOS DA GNU FREE DOCUMENTATION LICENSE COM O ENTENDIMENTO ADICIONAL DE QUE: <placeholder-1/>

source: Clipboards and Drag and Drop
pt_br: Áreas de transferência e Arrastar e Soltar

source: As users work with more and more types of data in different applications, they have an increasing need to share objects and data between their applications. GNOME supports two related methods for transfering data between applications: using drag and drop operations, and copying to and pasting from a system-wide clipboard. Both the clipboard and drag and drop work across multiple applications, including those not developed with GNOME.
pt_br: Como usuários trabalham com mais e mais tipos de dados em diferentes aplicativos, estes possuem uma crescente necessidade em compartilhar dados e objetos entre seus aplicativos. No GNOME há o suporte a dois métodos relacionados à transferência de dados entre aplicativos: usando operações de arrastar e soltar, e copiando e colando através de uma área de transferência em todo o sistema. Tanto a área de transferência quanto o arrastar e soltar funcionam sobre múltiplos aplicativos, incluindo aqueles não desenvolvidos com GNOME.

source: The clipboard is used when a user explicitly copies data in an application. The application then claims ownership of the clipboard. When the user pastes the data into another application, that application requests the clipboard data from the first application. Clipboard operations are fully supported in GTK+.
pt_br: A área de transferência é utilizada quando um usuário claramente copia dados em um aplicativo. Então o aplicativo reivindica a propriedade da área de transferência. Quando o usuário cola os dados em outro aplicativo, o aplicativo solicita os dados da área de transferência do primeiro aplicativo. O GTK+ oferece um suporte total das operações de área de transferência.

source: Drag and drop operations are similar, but they require the pointer to be tracked and updated as the user moves across potential drop targets. When an application is notified a pointer is moving over it during an active drag, it must update the cursor to indicate whether or not it can accept the drop. GTK+ provides drag and drop support with a sophisticated API that makes it easy to manage drop targets in your applications.
pt_br: Operações de arrastar e soltar são similares, mas elas requerem que o ponteiro seja rastreado e atualizado ao passo que o usuário move através de alvos potenciais. Quando um aplicativo é notificado que um ponteiro está se movendo sobre ele durante uma operação de arrastar ativa, ele deve atualizar o cursor para indicar se pode aceitar ou não aceitar a operação soltar. O GTK+ fornece suporte ao arrastar-e-soltar com uma sofisticada API que facilita gerenciar os alvos a soltar nos seus aplicativos.

source: Both the clipboard and drag and drop operations support content negotation. When an application has data to offer, it advertises which formats are available for that data. Receiving applications can request the most suitable formats. For instance, if a user copies text from a web browser, a word processor can maintain formatting by requesting the data in HTML, while a plain text editor can receive the text without formatting.
pt_br: Tanto a operação de área de transferência quanto a de arrastar-e-soltar possuem suporte à negociação de conteúdo. Quando um aplicativo possui dados a oferecer, ela avisa quais formatos estão disponíveis para aquele dado. Aplicativos receptores podem pedir os formatos mais adequados. Por exemplo, se um usuário copia um texto de uma navegador de internet, um processador de texto pode manter a formatação pedindo os dados no HTML, enquanto um editor de textos sem simples pode receber o texto sem a formatação.

source: You should provide clipboard and drag and drop functionality for any data your application operates on. The clipboard and drag and drop are useful for more than just text: files, graphics, and sound clips are all examples of data that can be transferred between applications. When you use GTK+, you automatically get clipboard and drag and drop support for text areas, color buttons, file choosers, and other built-in user interface controls. You should use the APIs in GTK+ to provide support for any other data in your application.
pt_br: Você deve oferecer funcionalidades como área de transferência e arrastar e soltar para qualquer tipo de dado que opere em seu aplicativo. A área de transferência e o arrastar e soltar são mais úteis do que apenas texto: arquivos, gráficos e clipes de som são todos exemplos de dados que podem ser transferidos entre aplicativos. Quando você utiliza o GTK+, você automaticamente obtêm suporte à área de transferência e arrastar e soltar para áreas de texto, botões coloridos, seletores de arquivos e outros controles de interface de usuário integrados. Você deve usar as APIs no GTK+ para fornecer suporte para qualquer outro tipo de dado no seu aplicativo.

source: For more information, see <ulink url="http://www.newplanetsoftware.com/xdnd/">Drag-and-Drop Protocol for the X Window System</ulink>, <ulink url="http://standards.freedesktop.org/clipboards-spec/clipboards-latest.txt">X Clipboard Explanation</ulink>, and <ulink url="http://freedesktop.org/wiki/ClipboardManager">The Clipboard Manager Specification</ulink>.
pt_br: Para maiores informações, consulte <ulink url="http://www.newplanetsoftware.com/xdnd/">Protocolo de arrastar e soltar para janelas de sistema X</ulink>, <ulink url="http://www.freedesktop.org/wiki/Standards/clipboards_2dspec">Explicação sobre da área de transferência X</ulink>, e <ulink url="http://www.freedesktop.org/wiki/Standards/clipboard_2dmanager_2dspec">A especificação do gerenciador de área de transferência</ulink>.

source: D-BUS Messaging
pt_br: Mensagens D-BUS

source: D-Bus is a cross-desktop message bus for sending events between various applications, the desktop, and low-level components of the system. D-Bus provides a simple API for sending messages to particular services and for broadcasting messages to all interested services. D-Bus enables different types of applications to communicate and integrate with each other and with the desktop, providing better interaction and a richer experience for the user.
pt_br: D-Bus é um barramento de mensagens entre várias áreas de trabalho para enviar eventos entre vários aplicativos, a área de trabalho, e componentes de baixo nível do sistema. D-Bus oferece uma API simples para enviar mensagens para serviços particulares e para transmitir mensagens a todos os serviços interessados. D-Bus permite que diferentes tipos de aplicativos comuniquem-se e integrem-se entre eles e com a área de trabalho, fornecendo uma melhor interação e uma experiência mais rica para o usuário.

source: D-Bus provides a session and a system bus. The session bus is used by applications in a single user session, allowing them to share data and event notifications and to integrate into the user's desktop. For example, movie players can send a D-Bus message to prevent the screensaver from activating when the user is watching a movie.
pt_br: D-Bus oferece um barramento de sessão e sistema. O barramento de sessão é utilizado por aplicativos em uma sessão de usuário única, permitindo-lhes compartilharem dados, notificações de eventos e integração dentro da área de trabalho do usuário. Por exemplo, um reprodutor de filmes pode enviar uma mensagem D-Bus para prevenir que a proteção de tela seja ativada quando o usuário estiver assistindo um filme.
