Repository: Kr0mAgn0n/gnome-devel-docs
Catalog: platform-overview/*/*.po
Languages: pt_br

source: You should use libgnomeprint whenever you need to render content to PostScript for printing. You should use libgnomeprintui to construct your printing user interface, even if your rendered output comes from another source. Using the GNOME print framework provides your users a consistent user interface with the features they expect of printing appliations.
pt_br: Você deve usar libgnomeprint toda vez que você precisar renderizar conteúdo de impressão para PostScript. Você deve usar libgnomeprintui para construir sua interface de impressão, mesmo se a sua saída renderizada vier de outra fonte. Ao utilizar o framework de impressão do GNOME é oferecido a seus usuários uma interface de usuário consistente com as características que eles esperam de aplicativos de impressão.

source: On most GNOME systems, CUPS (Common UNIX Printing System) acts as the low-level printing system. CUPS provides a modern, feature-rich architecture for printer discovery, printer option access, and spooling print jobs to different types of printers.
pt_br: Na maioria dos sistemas GNOME, o CUPS (Common UNIX Printing System) atua como sistema de impressão de baixo nível. O CUPS fornece uma moderna, arquitetura característica rica para descobrir impressoras, opções de acesso da impressora e organizando os trabalhos de impressão para diferentes tipos de impressoras - tarefas de impressão (spool).

source: CUPS provides a set of utilities for automatically discovering printers locally and on the network. This allows users not only to see all available printers, but to use different types of printers without manual configuration.
pt_br: CUPS oferece um conjunto de utilitários para automaticamente descobrir impressoras locais ou de rede. Isto permite que usuários não apenas vejam as impressoras disponíveis, mas também utilizem diferentes tipos de impressoras sem configurá-las manualmente.

source: CUPS provides a unified interface for printing, regardless of the location or type of the printer. Multiple print protocols are handled seamlessly by CUPS by automatically applying filters to content sent to the printers. Applications can simply provide PostScript output, and CUPS will automatically convert it for printers that do not support PostScript natively.
pt_br: CUPS oferece uma interface unificada para impressão, independente da localização ou do tipo da impressora. Múltiplos protocolos de impressão são manipulados discretamente pelo CUPS por automaticamente aplicarem filtros ao conteúdo enviado as impressoras. Aplicativos podem simplesmente oferecer uma saída PostScript e o CUPS irá automaticamente convertê-las, para impressoras que não suportam nativamente PostScript.

source: CUPS also provides printer configuration options in the form of PostScript Printer Description (PPD) files. PPD configurations allow applications to expose the capabilities of individual printers to the users with a consistent user interface. For instance, PPD allows you to detect whether a printer can collate and staple print jobs, and to provide an option in your user interface.
pt_br: CUPS também oferece opções de configuração de impressora na forma de arquivos de descrição de impressora PostScript (PPD). As configurações PPD permitem que aplicativos mostrem aos usuários as capacidades individuais das impressoras com uma interface de usuário consistente. Como exemplo, o PPD permite que você detecte se uma impressora pode ordenar e grampear os trabalhos de impressão, para fornecer uma opção na sua interface de usuário.

source: In most cases, you will not need to interface directly with CUPS in your applications. By using the GNOME print framework, you have access to the power and flexibility of CUPS automatically. Having CUPS underneath means a better user experience with less programming.
pt_br: Na maioria dos casos você não precisará interagir diretamente com o CUPS nos seus aplicativos. Ao utilizar o framework de impressão do GNOME, você possui automaticamente acesso ao poder e a flexibilidade do CUPS. Ter o CUPS nos bastidores significa uma melhor experiência do usuário com menas programação.

source: Language Bindings
pt_br: Ligações de Linguagens

source: Although the GNOME platform is written primarily in C, it is written intentionally to make it easy to bind to other programming languages. Using language bindings, you can develop with the GNOME platform natively in your programming language of choice.
pt_br: Apesar da plataforma GNOME ter sido inicialmente escrita em C, ela foi escrita intencionalmente para facilitar a ligação entre outras Linguagens de programação. Usando ligações (bindings) de linguagens, você pode desenvolver com a plataforma GNOME nativamente na sua linguagem de programação de sua escolha.

source: Language bindings exist for many programming languages, and the GNOME platform officially supports bindings for C++, Java, Perl, and Python.
pt_br: Ligações (Bindings) de Linguagens existem em muitas linguagens de programação e a plataforma GNOME oficialmente suporta C++, Java, Perl, e Python.

source: The C++ bindings provide complete coverage of the GNOME platform, including GTK+, Libglade, and GConf. The C++ bindings wrap all objects with native C++ objects and allow programmers to provide custom widgets with normal C++ inheritence. They provide a fully native API, with type-safe signal handlers, full use of the standard C++ library, and complete C++ memory management.
pt_br: As ligações do C++ oferecem cobertura completa na plataforma GNOME, incluindo GTK+, Glade e GConf. As ligações C++ envolvem todos os objetos com objetos nativos C++ e permitem que os programadores forneçam widgets personalizados com uma herança normal do C++. Eles fornecem uma API completamente nativa com manipuladores de sinal de tipo seguro, uso completo da biblioteca padrão do C++ e gerenciamento completo de memória do C++.

source: For more information on the GNOME C++ bindings, visit <ulink url="http://www.gtkmm.org/">the gtkmm web site</ulink>.
pt_br: Para maiores informações sobre as ligações C++ do GNOME, visite <ulink url="http://www.gtkmm.org/">o site do gtkmm</ulink>.

source: The Java bindings provide complete coverage of the GNOME platform, including GTK+, Cairo, and GConf. The Java bindings wrap all objects with native Java objects and allow programmers to provide custom widgets with normal Java inheritence. They provide a fully native API, using Java's class libraries and interfaces wherever appropriate.
pt_br: As ligações do Java oferecem cobertura completa na plataforma GNOME, incluindo GTK+, Cairo, e GConf. As ligações Java envolvem todos os objetos com objetos nativos Java e permitem que os programadores forneçam widgets personalizados com uma herança normal do Java. Eles fornecem uma API completamente nativa, ao usar interfaces e bibliotecas de classes do Java sempre que for apropriado.

source: For more information on the GNOME Java bindings, visit <ulink url="http://java-gnome.sourceforge.net/">the Java-GNOME web site</ulink>.
pt_br: Para maiores informações sobre as ligações Java no GNOME, visite <ulink url="http://java-gnome.sourceforge.net/">o site do Java-GNOME</ulink>.

source: The Perl bindings provide native Perl interfaces for the GNOME platform, including GTK+, GnomeVFS, and GConf. The Perl bindings wrap all objects with Perl objects and allow programmers to use standard Perl practices to manipulate them. They provide a fully native API, using Perl's native data types wherever appropriate.
pt_br: As ligações do Perl oferecem interfaces Perl nativas para a plataforma GNOME, incluindo GTK+, GnomeVFS e o GConf. As ligações Perl envolvem todos os objetos com objetos Perl e permitem que os programadores usem práticas padrões do Perl para manipulá-los. Eles fornecem uma API completamente nativa, ao usar tipos de dados nativos do Perl sempre que for apropriado.

source: For more information on the GNOME Perl bindings, visit <ulink url="http://gtk2-perl.sourceforge.net/">the gtk2-perl web site</ulink>.
pt_br: Para maiores informações sobre as ligações Perl no GNOME, visite <ulink url="http://gtk2-perl.sourceforge.net/">a página do gtk2-perl</ulink>.

source: The Python bindings provide native Python interfaces for the GNOME platform, including GTK+, GnomeVFS, and GConf. The Python bindings wrap all objects with native Python objects and allow programmers to provide custom widgets with normal Python inheritence. They provide a fully native Python API which automatically handles details like type casting and memory management.
pt_br: As ligações (bindings) Python oferecem interfaces Python nativas para a plataforma GNOME, incluindo GTK+, GnomeVFS e o GConf. As ligações Python envolvem todos os objetos com objetos Python nativos e permitem que os programadores ofereçam widgets personalizados com uma herança Python normal. Eles oferecem uma API Python completamente nativa que automaticamente manipula detalhes como tipo de conversão e gerenciamento de memória.

source: For more information on the GNOME Python bindings, visit <ulink url="http://www.pygtk.org/">the PyGTK web site</ulink>.
pt_br: Para maiores informações sobre as ligações Python no GNOME, visite <ulink url="http://www.pygtk.org/">a página do PyGTK</ulink>.

source: Other Languages
pt_br: Outros idiomas

source: Full or partial bindings exist for many other programming languages, such as C#, Eiffel, JavaScript, Ruby, and Scheme. Even though they may not currently be officially supported by GNOME, many of these bindings are of the same high quality as the official GNOME bindings, and some of them may be included as official GNOME bindings in future releases.
pt_br: Existem ligações integrais ou parciais para muitas outras linguagens de programação como C#, Eiffel, JavaScript, Ruby e Scheme. Apesar delas oficialmente poderem não ser suportadas pelo GNOME, muitas destas ligações são da mesma alta qualidade como as ligações oficiais do GNOME e algumas destas podem ser incluídas como ligações oficiais GNOME nos próximos lançamentos.

source: For a list of language bindings, visit <ulink url="http://www.gtk.org/language-bindings.html">the GTK+ bindings page</ulink>.
pt_br: Para uma lista de bindings (ligações) de linguagens, visite <ulink url="http://gtk.org/bindings.html">a página de bindings do GTK+</ulink>.

source: Quick Module Overview
pt_br: Visão-geral rápida dos módulos

source: This appendix provides a quick overview of the libraries included in the GNOME desktop and developer platform. Libraries are listed by module with a brief description and a link for more information in this document, where possible.
pt_br: Este apêndice oferece uma rápida visão geral sobre as bibliotecas inclusas na área de trabalho GNOME e na plataforma de desenvolvimento. Bibliotecas são listadas por módulos com uma breve descrição e um vínculo (link) para maiores informações sobre o referido documento, quando possível.

source: Platform Modules
pt_br: Módulos da plataforma

source: Modules in the GNOME developer platform make strict guarantees about API and ABI stability. Applications developed against platform modules can be assured of running unmodified for the duration of the GNOME 2 lifecycle.
pt_br: Os módulos na plataforma de desenvolvimento GNOME fazem garantias estritas sobre a estabilidade do API e ABI. Aplicativos desenvolvidos sobre módulos de plataforma são assegurados de que serão executados sem modificações durante o ciclo de vida do GNOME 2.

source: GConf provides the daemon and libraries for storing and retrieving configuration data. GConf is discussed in <xref linkend="gconf"/>.
pt_br: GConf fornece as bibliotecas e o daemon para armazenar e recuperar as preferências do usuário. GConf é discutido em <xref linkend="gconf"/>.

source: ORBit is a deprecated CORBA server. GNOME's deprecated component architecture, Bonobo, is built on top of CORBA. CORBA is discussed in <xref linkend="bonobo-corba"/>.
pt_br: ORBit é um servidor CORBA leve e ágil. A arquitetura de componentes do GNOME, o Bonobo, é construído sobre o CORBA. CORBA é discutido em <xref linkend="bonobo-corba"/>.

source: ATK provides the set of accessibility interfaces that are implemented by other toolkits and applications. Using the ATK interfaces, accessibility tools have full access to view and control running applications. ATK is discussed in <xref linkend="a11y"/>.
pt_br: ATK oferece o conjunto de interfaces de acessibilidade que são implementadas por outros kits de ferramentas e aplicativos. Ao utilizar interfaces ATK, ferramentas de acessibilidade possuem acesso completo à visualização e ao controle de aplicativos em execução. ATK é discutido em <xref linkend="a11y"/>.

source: GAIL provides an implementation of the ATK interfaces for GTK+ and GNOME libraries, allowing accessibility tools to interact with applications written using these libraries. In 2009 GAIL was moved into GTK+. Accessibility is discussed in <xref linkend="a11y"/>.
pt_br: GAIL fornece uma implementação das interfaces ATK para GTK+ e bibliotecas GNOME, permitindo que ferramentas de acessibilidade interajam com aplicativos escritos utilizando essas bibliotecas. Acessibilidade é discutida em <xref linkend="a11y"/>

source: A part of GLib, the GIO library provides a high-level API for accessing files and folders. Together with the GVFS library, it provides a file system abstraction that allows transparent access to local and remote files. GIO is discussed in <xref linkend="gio"/>.
pt_br: Uma parte da GLib, a biblioteca GIO, oferece uma API de alto nível para acessar arquivos e pastas. Juntamente com a biblioteca GVFS, ela oferece uma abstração de sistema de arquivos que permite acesso de forma transparente aos arquivos locais e remotos. GIO é discutido em <xref linkend="gio"/>.

source: GLib provides the core application building blocks for libraries and applications written in C. It provides the core object system used in GNOME, the main loop implementation, and a large set of utility functions for strings and common data structures.
pt_br: GLib fornece os blocos centrais de construção de aplicativos para bibliotecas e aplicativos escrito em C. Ela oferece o sistema de objetos central usado no GNOME, a implementação de laço (loop) principal e uma larga gama de funções úteis para strings e estruturas de dados comuns.

source: GnomeVFS is a deprecated library for accessing files and folders. It is superseded by GIO and GVFS. Newly written code should use GIO instead.
pt_br: GnomeVFS é uma biblioteca antiquada (obsoleta) para acessar arquivos e pastas. Ela foi substituída pelo GIO e pelo GVFS. Novos códigos escritos devem utilizar GIO ao invés dele.

source: GTK+ is the primary library used to construct user interfaces in GNOME applications. It provides user interface controls and signal callbacks to control user interfaces. GTK+ is discussed in <xref linkend="gtk"/>.
pt_br: GTK+ é a biblioteca principal usada para construir interfaces de usuário em aplicativos GNOME. Ela oferece controles de interface de usuário e retorno de chamada de sinais para controlar interfaces de usuário. GTK+ é discutido em <xref linkend="gtk"/>.

source: GVFS provides a backend implementation for GIO, allowing access to numerous protocols with the GIO API. Developers do not access GVFS directly. Instead, applications written with GIO will automatically use GVFS on systems where it is enabled.
pt_br: GVFS fornece uma implementação de retaguarda (backend) para GIO, permitindo acesso a muitos protocolos com a API GIO. Desenvolvedores não acessam diretamente o GVFS. Ao invés disso, os aplicativos escritos com GIO usarão automaticamente GVFS em sistemas onde isto esteja ativado.

source: libIDL is a deprecated library for parsing Interface Definition Language (IDL) files, which are necessary for CORBA interfaces. libIDL is used by GNOME's deprecated CORBA implementation, ORBit. CORBA is discussed in <xref linkend="bonobo-corba"/>.
pt_br: libIDL é uma biblioteca de análise de arquivos de Interface Definition Language (IDL), que são necessários para as interfaces CORBA. libIDL é utilizado pela implementação CORBA do GNOME, o ORBit. CORBA é discutido em <xref linkend="bonobo-corba"/>.

source: libart is a deprecated graphics library which can render vector paths. It is used by the GnomeCanvas widget. Newly written code should not use libart_lgpl and instead use Cairo and/or other technologies.
pt_br: libart é uma biblioteca gráfica que pode renderizar traços vetoriais. Ela é utilizada pelo widget GnomeCanvas. Logo, código escrito não deve usar libart_lgpl e no seu lugar, usar Cairo e/ou outras tecnologias.

source: Bonobo is a deprecated framework for creating reusable components for use in GNOME applications, built on top of CORBA. Bonobo is discussed in <xref linkend="bonobo-corba"/>.
pt_br: Bonobo é um framework para criação de componentes reutilizáveis para serem usados em aplicativos GNOME, construído sobre o CORBA. Bonobo é discutido em <xref linkend="bonobo-corba"/>.

source: The deprecated Bonobo UI library provides a number of user interface controls using the Bonobo component framework. Bonobo is discussed in <xref linkend="bonobo-corba"/>.
pt_br: A biblioteca de interface Bonobo fornece uma porção de controles de interface de usuário utilizando o componente de framework Bonobo. Bonobo é discutido em <xref linkend="bonobo-corba"/>.

source: Libglade is a deprecated library for constructing user interfaces dynamically from XML descriptions. Libglade has been deprecated in favor of <ulink url="http://library.gnome.org/devel/gtk/stable/GtkBuilder.html">GtkBuilder</ulink>. Libglade allows programmers to construct their user interfaces using a graphical interface builder application, and then import those interface definitions. Libglade is discussed in <xref linkend="libglade"/>.
pt_br: Libglade é uma biblioteca obsoleta para construção de interfaces de usuário dinamicamente a partir de descrições XML. Libglade se tornou obsoleta em favor do <ulink url="http://library.gnome.org/devel/gtk/stable/GtkBuilder.html">GtkBuilder</ulink>. A Libglade permite que programadores construam suas interfaces de usuário usando um aplicativo de construção de interface gráfica e depois importando essas definições de interface. Libglade é discutido em <xref linkend="libglade"/>.

source: The deprecated libgnome library provides a number of useful routines for building modern applications, including session management, activation of files and URIs, and displaying help.
pt_br: A obsoleta biblioteca libgnome oferece uma diversidade de rotinas úteis para a construção de aplicativos modernos, incluindo: gerenciamento de sessão, ativação de arquivos e URIs e exibição de ajuda.

source: The GnomeCanvas widget provides a flexible widget for creating interactive structured graphics.
pt_br: O widget GnomeCanvas fornece um flexível widget para criação de interativos gráficos estruturados.

source: The deprecated libgnomeui library provides additional widgets for applications. Many of the widgets from libgnomeui have already been ported to GTK+.
pt_br: A obsoleta biblioteca libgnomeui oferece widgets adicionais para aplicativos. Muitos dos widgets do libgnomeui foram portados para o GTK+.

source: The libxml2 library provides a number of APIs for working with XML in a standards-compliant manner. The libxml2 library is discussed in <xref linkend="libxml2"/>.
pt_br: A biblioteca libxml2 oferece uma porção de APIs para trabalhar com XML de uma forma que atende os padrões de compatibilidade. A biblioteca libxml2 é discutida em <xref linkend="libxml2"/>.

source: The libxslt library provides a fast and complete implementation of XSLT, a language for transforming XML. The libxslt library is discussed in <xref linkend="libxslt"/>.
pt_br: A biblioteca libxslt oferece uma implementação rápida e completa do XSLT, uma linguagem para transformar XML. A biblioteca libxslt é discutida em <xref linkend="libxslt"/>.

source: Pango is the core text and font handling library used in GNOME applications. It has extensive support for the different writing systems used throughout the world. Pango is discussed in <xref linkend="pango"/>.
pt_br: Pango é a principal biblioteca de gerenciamento de texto e fonte utilizado em aplicativos GNOME. Possui extensivo suporte para diferentes sistemas de escrita usados por todo o mundo. Pango é discutido em <xref linkend="pango"/>.

source: Desktop Modules
pt_br: Módulos da área de trabalho

source: Modules in the GNOME desktop are not required to make the same API and ABI stability guarantees as modules in the platform, although attempts are made to keep them relatively stable. Often, modules are introduced in the desktop release to mature, and are moved into the platform once they've stabilized.
pt_br: Não exige-se dos módulos na área de trabalho GNOME que possuam as mesmas garantias de estabilidade de API e ABI como os módulos na plataforma, ainda que tentativas sejam feitas para mantê-los relativamente estáveis. Frequentemente os módulos são apresentados no lançamento da área de trabalho para amadurecerem e são movidos para a plataforma uma vez que estiverem estabilizados.

source: The eel library provides a number of additional widgets primarily for use inside <application>Nautilus</application>, the GNOME file manager. Many of the widgets in eel have since been provided in GTK+.
pt_br: A biblioteca eel fornece uma porção de widgets adicionais para serem utilizados principalmente no <application>Nautilus</application>, o gerenciador de arquivos do GNOME. Muitos dos widgets na eel tem sido desde então fornecidas no GTK+.

source: Evolution Data Server provides a unified location for address book and calendar information, allowing multiple applications to share the same data. Evolution Data Server is discussed in <xref linkend="address-book-calendar"/>.
pt_br: O Servidor de dados do Evolution fornece uma localização unificada para informações sobre livro de endereços e calendário, permitindo que múltiplos aplicativos compartilhem os mesmos dados. O Servidor de dados do Evolution é discutido em <xref linkend="address-book-calendar"/>.

source: In addition to the actual panel, the gnome-panel package provides the libraries used to construct panel applets to run on the user's panel. Panel applets are discussed in <xref linkend="panel-applets"/>.
pt_br: Fora o painel atual, o pacote gnome-panel oferece as bibliotecas usadas na construção de miniaplicativos do painel para serem executadas no painel do usuário. Miniaplicativos do painel são discutidos em <xref linkend="panel-applets"/>.

source: The GNOME keyring manager provides a modern and secure means of storing users' passwords and other sensitive data. Keys are encrypted and can only be accessed by explicit user permission. The keyring manager is discussed in <xref linkend="keyring"/>.
pt_br: O gerenciador de chaveiros do GNOME oferece meios seguros e modernos para armazenamento de senhas dos usuários e outros dados sensíveis. As chaves são codificadas e apenas podem ser acessadas por permissão explícita do usuário. O gerenciador de chaveiros é discutido em <xref linkend="keyring"/>.

source: GStreamer is the powerful multimedia used throughout GNOME to play, create, and manipulate sound and video. GStreamer is discussed in <xref linkend="multimedia"/>.
pt_br: GStreamer é o poderoso sistema multimídia utilizado em todo o GNOME para executar, criar e manipular som e vídeo. GStreamer é discutido em <xref linkend="multimedia"/>.
