Repository: Kr0mAgn0n/gnome-devel-docs
Catalog: platform-overview/*/*.po
Languages: pt_br

source: GConf can look up settings from different settings at once, typically from different locations on the file system. By having appropriate system sources configured, GConf enables systems administrators to provide both default and mandatory settings for all users. Tools such as GNOME's <application>Configuration Editor</application> and <application>Sabayon</application> make it easy to deploy fully configured systems using GConf.
pt_br: GConf pode consultar ajustes de diferentes configurações de uma só vez, geralmente de diferentes locais no sistema de arquivos. Por ter apropriados recursos de sistemas configurados, o GConf permite que administradores de sistemas forneçam tanto ajustes padrão quanto ajustes obrigatórios para todos os usuários. Ferramentas como o <application>Editor de configuração</application> do GNOME e o <application>Sabayon</application> facilitam distribuir sistemas completamente configurados usando GConf.

source: The GConf client library provides notifications of changes to settings, making it easy to provide instant-apply settings in your application, regardless if settings are changed from within your application or using another tool. Setting the value of a key will notify all interested applications, allowing desktop-wide and other cross-application settings to work instantly and effortlessly.
pt_br: A biblioteca cliente GConf oferece notificações de alterações em ajustes, facilitando oferecer ajustes de aplicação instantânea no seu aplicativo, independente se os ajustes são alterados dentro do seu aplicativo ou usando outra ferramenta. Ajustar o valor de uma chave notificará todos os aplicativos interessados, permitindo que ajustes completos da área de trabalho e de vários outros aplicativos trabalhem de forma instantânea e sem esforço.

source: GConf makes it easy to lock down systems by setting particular keys read-only, preventing users from changing their values. In addition, GNOME provides a number of high-level keys that can be used to disable actions such as saving to disk and changing the panel layout. Tools such as <application>Pessulus</application> make it easy for administrators to find and lock down important keys.
pt_br: GConf facilita o bloqueio de sistemas ao ajustar chaves particulares como apenas leitura, prevenindo que os usuários alterem seus valores. Ademais, GNOME oferece uma porção de chaves de alto nível que podem ser usadas para desativar ações como salvar em disco e mudar o layout do painel. Ferramentas como o <application>Pessulus</application> tornam mais fácil para os administradores a pesquisa e o bloqueio de chaves importantes.

source: You should use GConf to store all user preferences in your application. Using GConf will make it easy to provide instant-apply preferences, and it will make your settings accessible to systems administrators and configuration and backup tools.
pt_br: Você deveria usar o GConf para armazenar todas as preferências de usuário em seu aplicativo. Usar GConf facilitará o fornecimento de preferências de aplicação instantânea e fará suas configurações acessíveis para administradores de sistemas e ferramentas de configuração e backup.

source: For more information on GConf, see the <ulink url="http://library.gnome.org/devel/gconf/stable/">GConf Reference Manual</ulink>.
pt_br: Para maiores informações sobre o GConf, consulte o <ulink url="http://library.gnome.org/devel/gconf/stable/">Manual de referência do GConf</ulink>.

source: Internationalization
pt_br: Internacionalização

source: The GNOME Desktop and Developer Platform provides full support for internationalizing and localizing applications. Internationalization is the process of ensuring your application can be localized, including marking all strings for translations, using numbers and format strings correctly, and making adjustments for variations in conventions for times and dates, units, and formatting.
pt_br: A área de trabalho GNOME e a Plataforma de desenvolvimento oferecem suporte completo para internacionalização e localização de aplicativos. Internacionalização é o processo de garantia de que seu aplicativo pode ser localizado, incluindo a marcação de todas as strings para tradução, usando números e formato de strings corretamente e ajustando para variações nas convenções de datas e horas, unidades e formatação.

source: GNOME uses the standard gettext and related routines for accessing localizations. Support for localization using gettext is built into every component of the GNOME platform. Your source code can be scanned for specially-marked tools by automated tools. Those strings are then placed in PO files to allow translators to track their translations. Using gettext, you can easily and efficiently access translated versions of all user-visible strings in your application from translation domains installed along with your application.
pt_br: GNOME usa o padrão gettext e rotinas relacionadas para acessar localizações. Em cada componente da plataforma GNOME são construídos suporte a localização usando gettext. Ferramentas automatizadas podem escanear seu código fonte para encontrar mensagens com marcações especiais. Estas mensagens (strings) são então colocadas em arquivos PO para permitir que tradutores rastreiem suas traduções. Ao usar gettext, você pode facilmente e de forma eficiente acessar versões traduzidas de todas as mensagens visíveis a usuários no seu aplicativo, a partir de domínios de tradução instalados juntamente com o seu aplicativo.

source: These translation domains can be created using PO files, which can be used by translators to track string changes and update their translations accordingly. GNOME ships with intltool, a tool for managing translations in PO files. Using intltool, translators can use PO files to translate not only the strings in your application, but also other types of files that you use, such as GConf schema files, desktop entry files, and XML files.
pt_br: Esses domínios de tradução podem ser criados usando arquivos PO, os quais podem ser usados por tradutores para rastrear alterações de strings e atualizar suas traduções adequadamente. GNOME vem junto com o intltool, uma ferramenta para gerenciamento de traduções em arquivos PO. Ao usar o intltool, tradutores podem usar arquivos PO para traduzirem não apenas as strings em seu aplicativo, mas também outros tipos de arquivo que você use, como arquivos de esquema GConf, arquivos de entrada da área de trabalho e arquivos XML. translators can use PO files to translate not only the strings in your application, but also other types of files that you use, such as GConf schema files, desktop entry files, and XML files.

source: GNOME also provides the xml2po tool as part of the gnome-doc-utils package. This tool allows translators to use PO files to create translated versions of documentation written in various XML formats, including XHTML and DocBook.
pt_br: GNOME também fornece a ferramenta xml2po como parte do pacote gnome-doc-utils. Esta ferramenta permite que os tradutores usem arquivos PO para criar versões traduzidas da documentação escrita em vários formatos XML, incluindo XHTML e DocBook.

source: Internationalization involves more than just allowing strings to be translated, and GNOME supports your application development at every step of the process. GTK+ will automatically adjust its presentation for languages that are read right-to-left, and Pango has complete support for rendering bidirectional text and text in various different writing systems. GTK+ supports multiple input methods, allowing users from all language to input text efficiently with their keyboards. The entire GNOME platform uses the UTF-8 encoding of Unicode natively, providing access to the characters and writing systems of the entire world.
pt_br: Internacionalização envolve muito mais que apenas permitir que strings sejam traduzidas e o GNOME suporta que o desenvolvimento de seu aplicativo o seja a cada passo do processo. GTK+ irá automaticamente ajustar a apresentação do aplicativo para idiomas que são lidos da direita para a esquerda e o Pango possui suporte completo para renderização bidirecional de texto e texto em diversos sistemas de escrita. GTK+ suporta múltiplos métodos de entrada, permitindo que usuário de todos os idiomas insiram textos de forma eficiente com seus teclados. A plataforma GNOME inteira usa a codificação nativa UTF-8 de Unicode, fornecendo acesso a caracteres e sistemas de escrita do mundo todo.

source: <application>Gnumeric</application> in Multiple Languages
pt_br: <application>Gnumeric</application> em múltiplos idiomas

source: Screenshots of the <application>Gnumeric</application> spreadsheet application running in Hebrew, Japanese, and Serbian.
pt_br: Capturas de tela do <application>Gnumeric</application> aplicativo de planilha sendo executado em hebraico, japonês e sérvio.

source: Internationalizing your application helps make it available to many more users across the world. While skilled translators must provide translations for any language, programmers must ensure the application is properly internationalized before it can be fully localized.
pt_br: Internacionalizar seu aplicativo ajuda a torná-lo disponível para muito mais usuários ao redor do mundo. Enquanto tradutores experientes devem fornecer traduções para qualquer idioma, programadores devem assegurar-se de que o aplicativo é devidamente internacionalizável antes dele ser totalmente localizado.

source: For more information on internationalization in GNOME, see <ulink url="http://www.gnome.org/~malcolm/i18n/">Internationalizing GNOME Applications</ulink>.
pt_br: Para maiores informações sobre internacionalização no GNOME, consulte <ulink url="http://www.gnome.org/~malcolm/i18n/">Internacionalizando aplicativos GNOME</ulink>.

source: Accessibility
pt_br: Acessibilidade

source: Accessibility is the process of ensuring your application can be used by people with various disabilities. Disabilities come in many forms: visual impairments, movement impairments, hearing impairments, cognitive and language impairments, and seizure disorders. Many people have some sort of disability, and making your application accessibility will allow more people to use your application effectively.
pt_br: Acessibilidade é o processo de certificar-se de que seu aplicativo pode ser utilizado por pessoas com várias deficiências. Deficiências podem vir de muitas formas: deficiências visuais, disfunções motoras, dificuldades auditivas, problemas de cognição e fala e distúrbios convulsivos. Muitas pessoas possuem alguma espécie de incapacidade e ao fazer seus aplicativos acessíveis, você permitirá que mais pessoas utilizem seu software efetivamente.

source: GNOME provides support for accessibility devices using the ATK framework. This framework defines a set of interfaces to which graphical interface components adhere. This allows, for instance, screen readers to read the text of an interface and interact with its controls. ATK support is built into GTK+ and the rest of the GNOME platform using the GAIL library, so any application using GTK+ will have reasonable accessibility support for free.
pt_br: GNOME oferece suporte para dispositivos de acessibilidade usando o framework ATK. Este framework define um conjunto de interfaces as quais os componentes de interface gráfica deverão aderir. Isto permite, por exemplo, que leitores de tela leiam o texto de uma interface e interajam com seus controles. O suporte para ATK é construído dentro do GTK+ e de todo o resto da plataforma GNOME usando a biblioteca GAIL, então qualquer aplicativo usando GTK+ terá suporte razoável a acessibilidade de graça.

source: Nonetheless, you should be aware of accessibility issues when when developing your applications. Although GTK+ interfaces provide reasonable accessibility by default, you can often improve how well your program behaves with accessibility tools by providing additional information to ATK. If you develop custom widgets, you should ensure that they expose their properties to ATK. You should also avoid using sound, graphics, or color as the sole means of conveying information to the user.
pt_br: Apesar de tudo você deveria conscientizar-se das questões de acessibilidade ao desenvolver seus aplicativos. Embora as interfaces GTK+ ofereçam por padrão acessibilidade razoável, você pode muitas vezes melhorar o quão bem seu programa se comporta com ferramentas de acessibilidade ao oferecer informações adicionais para o ATK. Se você desenvolve widgets personalizados, você deve certificar-se de que eles revelam suas propriedades ao ATK. Você também deveria evitar usar apenas áudio, gráficos ou cores como único caminho de transmissão de informações para o usuário.

source: The GNOME desktop ships with a number of accessibility tools which enable users with disabilities to take full advantage of their desktop and applications. Applications that fully implement ATK will be able to work with the accessibility tools. GNOME's accessibility tools include a screen reader, a screen magnifier, an on-screen keyboard, and <application>Dasher</application>, an innovative predictive text entry tool.
pt_br: A área de trabalho GNOME vem junto com uma porção de ferramentas de acessibilidade que permitem aos usuários com deficiências usufruírem ao máximo sua área de trabalho e seus aplicativos. Aplicativos que implementam completamente o ATK estarão aptas a trabalharem com as ferramentas de acessibilidade. As ferramentas de acessibilidade do GNOME incluem um leitor de tela, um ampliador de tela, um teclado sobre a tela, e o <application>Dasher</application>, uma ferramenta inovadora de predição de entrada de texto.

source: For extensive recommendations on accessibility, see <ulink url="http://developer.gnome.org/projects/gap/guide/gad/index.html">GNOME Accessibility for Developers</ulink>. See also <ulink url="http://library.gnome.org/devel/atk/stable/">ATK - Accessibility Toolkit</ulink> and the <ulink url="http://library.gnome.org/devel/gail-libgail-util/stable/">GAIL Reference Manual</ulink>.
pt_br: Para vastas recomendações sobre acessibilidade, visite <ulink url="http://developer.gnome.org/projects/gap/guide/gad/index.html">Acessibilidade GNOME para desenvolvedores</ulink>. Veja também o <ulink url="http://library.gnome.org/devel/atk/stable/">ATK - kit de ferramentas de acessibilidade</ulink> e o <ulink url="http://library.gnome.org/devel/gail-libgail-util/stable/">Manual de referência GAIL</ulink>.

source: Multimedia
pt_br: Multimídia

source: GStreamer is a powerful multimedia library for playing, creating, and manipulating sound, video, and other media. You can use GStreamer to provide sound and video playback, record input from multiple sources, and edit multimedia content. GStreamer supports encoding and decoding numerous formats by default, and support for additional formats can be added with plug-ins.
pt_br: GStreamer é uma poderosa biblioteca multimídia para reprodução, criação e manipulação de áudio, vídeo e outras mídias. Você pode usar GStreamer para oferecer playback de áudio e vídeo, gravar entradas de múltiplas fontes e editar conteúdos multimídia. GStreamer suporta codificação e decodificação de muitos formatos por padrão e possui suporte adicional a formatos adicionais, podendo ser adicionados por plug-ins.

source: GStreamer provides a flexible architecture wherein media is processed through a pipeline of elements. Each element may apply filters to the content, such as encoding or decoding, combining multiple sources, or transforming the multimedia content. This architecture allows for an arbitrary arrangement of elements, so that you can accomplish virtually any effect using GStreamer. Furthermore, GStreamer is designed to have low overhead, so it can be used in applications with high demands on latency.
pt_br: GStreamer oferece uma arquitetura flexível onde mídia é processada através de uma linha de processamento de elementos. Cada elemento pode aplicar filtros de conteúdo como codificação ou decodificação, combinação de múltiplas fontes ou transformação de conteúdo multimídia. Esta arquitetura permite por uma arbitrária combinação de elementos que você possa realizar virtualmente qualquer efeito usando GStreamer. Além do mais, o GStreamer foi projetado para ter baixa sobrecarga (de memória), deste modo pode ser utilizado em aplicativos com altas demandas de latência.

source: While GStreamer provides a powerful API for manipulating multimedia, it also provides convenient routines for simple playback. GStreamer can automatically construct a pipeline to read and playback files in any supported format, allowing you to use sound and video in your application easily.
pt_br: Enquanto GStreamer fornece uma poderosa API para manipulação multimídia, ele também oferece rotinas convenientes para reproduções simples. GStreamer pode automaticamente construir uma linha de processamento para ler e reproduzir arquivos em qualquer formato suportado, permitindo que você facilmente utilize áudio e vídeo no seu aplicativo.

source: The GStreamer architecture allows plugins to add encoders, decoders, and all sorts of content filters. Third-party developers can provide GStreamer plugins which will be automatically available to other applications using GStreamer. Plugins can provide support for other multimedia formats or provide additional functionality and effects.
pt_br: A arquitetura do GStreamer permite que plug-ins adicionem codificadores, decodificadores e todos os tipos de filtros de conteúdo. Desenvolvedores de terceiros podem oferecer plug-ins GStreamer que automaticamente estarão disponíveis para outros aplicativos utilizando GStreamer. Plug-ins podem oferecer suporte para outros formatos multimídia ou oferecerem funcionalidades e efeitos adicionais.

source: You should use GStreamer whenever you need to read or play multimedia content in your application, or if your application needs to manipulate sound or video. Using GStreamer makes your application development easy, and it provides you well-tested elements for many of your needs.
pt_br: Você deve usar GStreamer sempre que precise ler ou reproduzir conteúdos multimídia no seu aplicativo ou se seu aplicativo precise manipular som e vídeo. Usar GStreamer torna o desenvolvimento do seu aplicativo mais fácil e lhe fornece elementos bem testados para muitas das suas necessidades.

source: For comprehensive information on GStreamer, see <ulink url="http://gstreamer.freedesktop.org/data/doc/gstreamer/head/manual/html/index.html">The GStreamer Application Development Manual</ulink>, <ulink url="http://gstreamer.freedesktop.org/data/doc/gstreamer/head/gstreamer/html/">The GStreamer 0.10 Core Reference Manual</ulink>, and <ulink url="http://gstreamer.freedesktop.org/documentation/">the GStreamer documentation page</ulink>.
pt_br: Para uma informação abrangente sobre GStreamer, consulte o <ulink url="http://gstreamer.freedesktop.org/data/doc/gstreamer/head/manual/html/index.html">O manual de desenvolvimento do aplicativo GStreamer</ulink>, <ulink url="http://gstreamer.freedesktop.org/data/doc/gstreamer/head/gstreamer/html/">O manual de referência essencial do GStreamer 0.10</ulink>, e <ulink url="http://gstreamer.freedesktop.org/documentation/">a página de documentação do GStreamer</ulink>.

source: Printing
pt_br: Imprimindo

source: Most applications need to provide support for printing. Users expect to be able to print the contents they can view on-screen. The GNOME platform provides libraries to help you add support for high-quality printing to your application.
pt_br: A maioria dos aplicativos precisam prover suporte para impressão. Os usuários esperam ser capazes de imprimir os conteúdos que eles podem ver sobre a tela. A plataforma GNOME fornece bibliotecas para ajudá-lo a adicionar suporte para impressões de alta qualidade no seu aplicativo.

source: GNOME Print
pt_br: Impressão no GNOME

source: Note that this section is outdated and that libgnomeprint and libgnomeprintui have been deprecated in favor of <ulink url="http://library.gnome.org/devel/gtk/stable/Printing.html">GtkPrint</ulink>. Printing has been integrated directly into GTK+ 2.10 and later versions, providing a cross-platform print API that all applications can use. API and ABI stability guarantees ensures that Gnomeprint will continue to be functional and supported throughout the GNOME 2 lifecycle.
pt_br: Note que está seção está ultrapassada e que o libgnomeprint eo libgnomeprintui estão obsoletos em favor do <ulink url="http://library.gnome.org/devel/gtk/stable/Printing.html">GtkPrint</ulink>. A impressãofoi integrada diretamente para o GTK+ 2.10 e versões posteriores, provendo um API de impressão independente de plataforma que todos os aplicativos podem utilizar. A estabilidade da API e da ABI são garantias de que ele continuará a ser funcional e suportado por todo o clico de vida do GNOME 2.

source: The GNOME print framework consists of two libraries which help you provide high-quality printing with a consistent interface in your application. At the core of the printing framework is libgnomeprint, a library for creating PostScript output to send to printers. On top of that is libgnomeprintui, which provides standard print controls for your user interface.
pt_br: O framework de impressão do GNOME consiste em duas bibliotecas as quais lhe permite fornecer uma impressão de alta qualidade com uma interface consistente em seus aplicativos. O núcleo do framework de impressão é o libgnomeprint, uma biblioteca para criar saída de PostScript para enviar às impressoras. No topo disso tudo fica o libgnomeprintui, que fornece os controles de impressão padrão para sua interface de usuário.

source: The libgnomeprint library implements the PostScript imaging model, which is used by most printers. Printers which do not support PostScript can still be supported through CUPS, described below. In addition to the standard PostScript imaging, libgnomeprint also features alpha channel support and anti-aliasing.
pt_br: A biblioteca libgnomeprint implementa o modelo de imagem PostScript, que é usado pela maioria das impressoras. Impressoras que não suportam PostScript podem ainda serem suportadas através do CUPS, descrito abaixo. Além da imagem PostScript padrão, libgnomeprint também apresenta suporte a canal alfa e suavização (anti-aliasing).

source: The libgnomeprintui library provides a standard print dialog, a print preview dialog, and various other controls and functionality required to build printing into an intuitive user interface. The GNOME print framework handles the details of locating printers and spooling print jobs, and also provides PostScript and PDF export directly in the print dialog.
pt_br: A biblioteca libgnomeprintui oferece uma janela de diálogo padrão de impressão, um diálogo de visualização prévia e muitos outros controles e funcionalidades precisas para construir uma impressão dentro de uma interface de usuário intuitiva. O framework de impressão do GNOME manipula os detalhes de localização de impressoras e das tarefas de trabalhos de impressão (spool) e também fornece exportação direta de PostScript e PDF diretamente no diálogo de impressão.
