Repository: Kr0mAgn0n/gnome-devel-docs
Catalog: platform-overview/*/*.po
Languages: pt_br

source: If you have existing software that you want to port to the GNOME platform, you should see the online <ulink url="http://live.gnome.org/GuideForISVs">Guide For ISVs</ulink> in addition to this guide.
pt_br: Se você possui um software existente que queira portar na plataforma GNOME, você deve consultar o <ulink url="http://live.gnome.org/GuideForISVs">Guia on-line para ISVs</ulink> além deste guia.

source: The GNOME Family
pt_br: A família GNOME

source: GNOME is a global effort, with many contributors all over the world. GNOME is a success because of its contributors and users. This section lists the web sites and conferences where you can learn more about GNOME, as well as other organizations that work with GNOME.
pt_br: O GNOME é um esforço global, com muitos contribuidores de todos os cantos do mundo e é um sucesso por causa de seus contribuidores e usuários. Esta seção lista os sites da web e conferências onde você pode aprender mais sobre GNOME, assim como outras organizações que trabalham com GNOME.

source: Web Sites
pt_br: SItes da Web

source: The primary web site for GNOME users. It contains release information, downloads, and documentation.
pt_br: O site principal para usuários GNOME. Ele possui informações sobre lançamentos, downloads e documentação.

source: The complete source for all GNOME documentation. It contains all of the user and developer documentation produced by GNOME, automatically built and updated for each release.
pt_br: A fonte completa de toda a documentação GNOME. Nela contém toda a documentação de desenvolvedor e usuário produzida pela GNOME, automaticamente compilada e atualizada para cada lançamento.

source: The web site for the GNOME Foundation, the not-for-profit foundation that oversees the development of GNOME.
pt_br: O site da web para a Fundação GNOME, a fundação sem fins lucrativos que supervisiona o desenvolvimento do GNOME.

source: The GNOME bug trackers. Use this site to submit a bug report or feature request, or to track the status of a report.
pt_br: O rastreador de bugs do GNOME. Use este site para enviar um relatório de erro, para solicitar uma funcionalidade ou para rastrear o status de um relatório.

source: The GNOME wiki. Many projects within GNOME now use the wiki as their primary web space. In additional, the wiki is often used to sketch out future development.
pt_br: O wiki do GNOME. Muitos projetos dentro do GNOME agora utilizam o wiki como seus principais sites. Ademais, o wiki é frequentemente utilizado para esboçar futuros desenvolvimentos.

source: The old website for developer information. This once contained developer documentation and information about the usability, documentation, and translation teams. The content on this site has since been largely superseded by <ulink url="http://library.gnome.org/">library.gnome.org</ulink> and <ulink url="http://live.gnome.org/">live.gnome.org</ulink>. There may still be some information on this site that is not found elsewhere.
pt_br: O antigo site de informações para desenvolvedores. Nele havia documentação de desenvolvedores e informações sobre usabilidade, documentação e equipes de tradução. O conteúdo deste site foi amplamente superado pelo <ulink url="http://library.gnome.org/">library.gnome.org</ulink> e <ulink url="http://live.gnome.org/">live.gnome.org</ulink>. Porém, ainda deve haver algumas informações neste site que não são encontradas em lugar algum.

source: Information on GNOME mailing lists. This site contains full archives of all GNOME mailing lists.
pt_br: Informações sobre listas de discussão do GNOME. Este site contem os arquivos completos de todas as listas de discussão do GNOME.

source: The GNOME Git repository, tracking all GNOME source code back to the inception of the project.
pt_br: O repositório Git do GNOME, rastreando todo o código fonte GNOME desde os primórdios do projeto.

source: Mailing Lists
pt_br: Listas de discussão

source: The primary mailing list for GNOME users.
pt_br: A lista primária de discussão para usuários GNOME.

source: Information and questions about development using the GNOME platform.
pt_br: Informações e questões sobre desenvolvimento usando a plataforma GNOME.

source: The first place to go to get involved with GNOME.
pt_br: O primeiro local a ir para se envolver com o GNOME.

source: Information on accessibility in GNOME applications.
pt_br: Informações sobre acessibilidade em aplicativos do GNOME.

source: Information on writing documentation for GNOME applications.
pt_br: Informações sobre como escrever documentações para aplicativos GNOME.

source: Information about internationalization and localization of GNOME applications.
pt_br: Informações sobre internacionalização e localização de aplicativos GNOME.

source: usability
pt_br: usabilidade

source: Information on usability for GNOME applications.
pt_br: Informações sobre usabilidade em aplicativos GNOME.

source: Conferences
pt_br: Conferências

source: The primary conference for GNOME users and developers. GUADEC is hosted annually in May or June. Each year, it is hosted in a different European city, making it an excellent excuse to see more of Europe. GUADEC features talks aimed at users, developers, and vendors.
pt_br: A principal conferência para usuários e desenvolvedores GNOME. A GUADEC anualmente acontece em Maio ou Junho. A cada ano, ela é hospedada em uma cidade européia diferente, fazendo-a uma excelente desculpa para conhecer mais a Europa. A GUADEC é destinada a usuários, desenvolvedores e fornecedores.

source: The GNOME Summit
pt_br: O GNOME Summit

source: The hacker get-together. The Summit is geared primarily at existing GNOME developers, although there is often useful information for new developers. The Summit is hosted annually in Boston.
pt_br: O encontro dos hackers. O Summit é destinado principalmente para os desenvolvedores existentes do GNOME, embora haja informações úteis para novos desenvolvedores. A Cúpula acontece anualmente em Boston.

source: A casual get-together hosted annually at linux.conf.au.
pt_br: Um encontro casual que acontece anualmente em linux.conf.au.

source: Other Organizations
pt_br: Outras organizações

source: The collaborative effort for interoperability and shared technology among desktop environments. Through freedesktop.org, GNOME works with projects such as KDE and XFCE to make it easier for application developers to provide better experiences for their users.
pt_br: O esforço colaborativo para interoperabilidade e tecnologia compartilhada entre ambientes de trabalho. Através do freedesktop.org, o GNOME trabalha com projetos como o KDE e XFCE para facilitar aos desenvolvedores proverem melhores experiências para seus usuários.

source: The free web engine, and a whole lot more. GNOME maintains close ties to the Mozilla development team to provide an overall better user interface.
pt_br: O mecanismo de web livre e muitos outros mais. GNOME mantém laços estreitos com a equipe de desenvolvimento do Mozilla para fornecer completamente uma melhor interface de usuário.

source: The free office suite. GNOME works with the OpenOffice.org development team to help provide a more unified interface when using the free office suite on GNOME.
pt_br: A suíte de escritório livre. O GNOME trabalha com a equipe de desenvolvimento do OpenOffice.org para ajudar a fornecer uma interface mais unificada quando utilizarmos a suíte de escritório livre no GNOME.

source: Freedom. Established in 1985, the Free Software Foundation has worked to create a complete free operating systems, giving its users the freedom to use, modify, and redistribute their software. As part of the GNU project, GNOME aims to provide a fully free desktop environment.
pt_br: Liberdade. Fundada em 1985, a Free Software Foundation tem trabalhado para criar sistemas operacionais completamente livres, dando aos seus usuários a liberdade de uso, modificação e redistribuição de seu software. Como parte do projeto GNU, o GNOME visa fornecer um ambiente de área de trabalho totalmente livre.

source: Application and File Type Registries
pt_br: Aplicações e Registros de tipos de arquivo

source: In order for applications to be useful, users need to be able to find and run them. Users of the GNOME desktop may run applications using the applications menu, or they may run them by accessing files in the file manager. The GNOME desktop allows you to add applications and file types when you install your application. The mechanism for these is specified on <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink>, so the same data will allow your application to function in other desktop environments.
pt_br: A fim de que aplicativos sejam úteis, usuários precisam estar aptos para encontrá-los e executá-los. Os usuários da área de trabalho GNOME podem executar aplicativos usando o menu de aplicativos ou podem executá-los acessando arquivos no gerenciador de arquivos. A área de trabalho GNOME lhe permite adicionar aplicativos e tipos de arquivos quando você instala seu aplicativo. O mecanismo para isso é especificado em <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink>, logo os mesmos dados permitirão que seu aplicativo funcione em outros ambientes de trabalho.

source: Adding your application is as simple as providing a desktop entry file with the necessary information. Desktop entry files use a simple key-value syntax, with extra provisions for providing translated content of particular values. Your application's desktop entry file will contain the following information:
pt_br: Adicionar seu aplicativo é tão fácil quanto fornecer um arquivo de entrada para a área de trabalho com as informações necessárias. Arquivos de entrada da área de trabalho utilizam uma sintaxe de valor de chave simples com campos extras de conteúdos traduzidos de valores particulares fornecidos. Seu arquivo de entrada de aplicativo da área de trabalho irá conter a seguinte informação:

source: A name and a comment, each translated into as many languages as your application supports,
pt_br: Um nome e um comentário, cada qual traduzidos em tantos idiomas quanto o seu aplicativo possui suporte,

source: A list of categories from a fixed list, which are used to place your application in the applications menu,
pt_br: Uma lista de categorias de uma lista fixa, que são utilizadas para colocar seu aplicativo no menu de aplicativos,

source: An icon, either as a full file path or as a simple name for the icon theme system,
pt_br: Um ícone, que pode ser um caminho de arquivo completo ou com um simples nome para o tema de ícones do sistema,

source: A list of file types that your application supports, and
pt_br: Uma lista de tipos de arquivo que seu aplicativo possui suporte, e

source: The command to run your application.
pt_br: O comando para executar seu aplicativo.

source: If your application handles custom file types that are not already known by the system, you will need to add those types to the file type registry. All file types are accessed with MIME types. For example, Ogg Vorbis audio files have the MIME type <literal>application/ogg</literal>. To add a MIME type, you need to provide a description of the type using a MIME information XML file. These files provide a translated name for the type as well as information on how to determine which files are of the type, either by matching the file name or by inspecting the contents of the file.
pt_br: Se seu aplicativo lida com tipos de arquivos personalizados que não são conhecidos pelo sistema, você precisará adicionar estes tipos ao registro de tipos de arquivo. Todos os tipos de arquivo são acessados com tipos MIME. Por exemplo, arquivos de áudio Ogg Vorbis possuem o tipo MIME <literal>application/ogg</literal>. Para adicionar um tipo MIME, você precisa fornecer uma descrição do tipo usando um arquivo XML com a informação MIME. Esses arquivos fornecem um nome traduzido para o tipo assim como informações sobre como determinar quais arquivos são do tipo, seja coincidindo o nome do arquivo ou pela inspeção do conteúdo do arquivo.

source: For more information on applications, see <ulink url="http://standards.freedesktop.org/desktop-entry-spec/latest/">The Desktop Entry Specification</ulink> and <ulink url="http://standards.freedesktop.org/menu-spec/latest/">The Desktop Menu Specification</ulink>. For more information on file types, see <ulink url="http://standards.freedesktop.org/shared-mime-info-spec/latest/">The Shared MIME Info Specification</ulink>.
pt_br: Para maiores informações sobre aplicativos, consulte <ulink url="http://standards.freedesktop.org/desktop-entry-spec/latest/">A especificação de entrada de Desktop</ulink> e <ulink url="http://standards.freedesktop.org/menu-spec/latest/">A especificação do menu de Desktop</ulink>. Para maiores informações sobre tipos de arquivos, consulte <ulink url="http://standards.freedesktop.org/shared-mime-info-spec/latest/">A especificação das informações MIME compartilhadas</ulink>.

source: Panel Applets
pt_br: Miniaplicativos do painel

source: The GNOME desktop features flexible and powerful panels to which users can add any number of small applications, called panel applets. Panel applets can provide all sorts of quick access to all sorts of useful information and functionality. For instance, the GNOME desktop ships with panel applets to switch between windows and workspaces, display the current weather conditions, and display network activity, among many others.
pt_br: A área de trabalho GNOME apresenta painéis flexíveis e poderosos para que usuários possam adicionar qualquer número de pequenos aplicativos, chamados de miniaplicativos do painel. Miniaplicativos do painel podem fornecer todos os tipos de acesso rápido para todas as formas de funcionalidade e informações úteis. Por exemplo, a área de trabalho GNOME vem junto com os miniaplicativos do painel para alternar entre janelas e áreas de trabalho, exibir as condições climáticas atuais, exibir a atividade da rede, entre outras coisas.

source: You may provide a panel applet to augment the functionality of your application, or you may provide a simple stand-alone panel applet. If you simply need to display quick notifications, you should consider using the notification area instead, which is also displayed in the user's panel. Panel applets should be used when you need to provide more functionality than that provided by notification icons.
pt_br: Você pode fornecer um miniaplicativo de painel para ampliar a funcionalidade do seu aplicativo ou você pode fornecer um simples miniaplicativo de painel independente. Se você simplesmente precisa exibir notificações rápidas, você deveria considerar o uso da área de notificação, que também é exibido no painel do usuário. Miniaplicativos de painel devem ser usados quando você precisa fornecer mais funcionalidade que aquelas oferecidas pelos ícones de notificação.

source: Panel applets are independent processes that use Bonobo to communicate with the panel. Bonobo allows applets to integrate with the panel to provide a consistent user experience. For example, the context menu for every panel applet contains standard items to remove, move, and lock the applet. Each panel applet can then add items to the context menu to perform other actions. The <application>Weather Report</application> panel applet, for example, has context menu items to display a detailed report and to update the displayed information.
pt_br: Os miniaplicativos do painel são processos independentes que utilizam o Bonobo para comunicarem-se com o painel. O Bonobo permite que miniaplicativos integrem-se com o painel para fornecer uma consistente experiência de usuário. Por exemplo, o menu de contexto para cada miniaplicativo do painel contém itens padrões para excluir, mover e travar o miniaplicativo. Cada miniaplicativo do painel pode então adicionar itens ao menu de contexto para realizar outras ações. O miniaplicativo de painel <application>Relatório meteorológico</application>, por exemplo, possui itens de menu de contexto para exibir um relatório detalhado e para atualizar as informações exibidas.

source: For more information on panel applets, see the <ulink url="http://library.gnome.org/devel/panel-applet/stable/">Panel Applet Library</ulink>.
pt_br: Para maiores informações sobre miniaplicativos do painel, consulte a <ulink url="http://library.gnome.org/devel/panel-applet/stable/">Biblioteca de miniaplicativos do painel</ulink>.

source: Notification Area
pt_br: Área de notificação

source: In addition to launchers and panel applets, the GNOME panel also features a notification area that applications can use to notify users of events. Notifications can be used to alert the user of new emails, available updates, upcoming meetings, or any number of other events.
pt_br: Além dos lançadores e dos miniaplicativos de painel, o painel do GNOME também apresenta uma área de notificação que os aplicativos podem usar para notificar eventos aos usuários. As notificações podem ser usadas para alertar o usuário de novos e-mails, atualizações disponíveis, futuras reuniões ou quaisquer outros eventos.

source: Notifications are simple icons that your application can place in the notification area on the user's panel. Your application can then take further action when the user clicks on the icon. Currently, the notification system is implemented in the experimental Egg library; however, the next version of GTK+ will have support for notification icons.
pt_br: As notificações são ícones simples que seu aplicativo pode dispôr na área de notificação no painel do usuário. Seu aplicativo pode então tomar uma nova ação quando o usuário clica sobre o ícone. Atualmente o sistema de notificação é implementado com a biblioteca experimental Egg; entretanto a próxima versão do GTK+ terá suporte para ícones de notificação.

source: The notification area is a <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink> specification, so your notification icons will appear in other desktop environments as well. For more information on the notification area, see <ulink url="http://standards.freedesktop.org/systemtray-spec/latest/">The System Tray Protocol Specification</ulink>.
pt_br: A área de notificação é uma especificação do <ulink url="http://www.freedesktop.org/">freedesktop.org</ulink>, logo seus ícones de notificação aparecerão também em outros ambiente de trabalho. Para maiores informações a respeito da área de notificação, consulte a <ulink url="http://standards.freedesktop.org/systemtray-spec/latest/">Especificação de protocolo da área de notificação</ulink>.

source: File Manager
pt_br: Gerenciamento de arquivos

source: GNOME ships with <application>Nautilus</application>, an intuitive and powerful file manager. Using the advanced GVFS technology, <application>Nautilus</application> is able to display remote folders just like folders on the local file system, giving users access to all their files everywhere with a single consistent interface.
pt_br: GNOME vem junto com o <application>Nautilus</application>, um gerenciador de arquivos intuitivo e poderoso. Ao utilizar a avançada tecnologia GVFS, o <application>Nautilus</application> é capaz de exibir pastas remotas como se fossem pastas no sistema de arquivo local, provendo aos usuários acesso a todos os seus arquivos em qualquer lugar com uma interface simples e apropriada.

source: <application>Nautilus</application> provides a plugin interface, enabling developers to extend its functionality to provide more information about users' files. This provides a richer and more coherant experience for users, removing the need for seperate applications to manage various types of files.
pt_br: O <application>Nautilus</application> oferece uma interface de plug-in, permitindo aos desenvolvedores estenderem suas funcionalidades para proverem maiores informações sobre os arquivos do usuário. Isto fornece uma experiência rica e mais coerente para os usuários, retirando a necessidade de separar aplicativos para o gerenciamento de vários tipos de arquivos.

source: <application>Nautilus</application> plugins can extend the file manager's functionality in a number of ways. Plugins can add extra information to file properties dialogs, providing users with everything they need to know about files. For example, GNOME ships with a plugin to display extra information about audio and video files, such as the codec used, the dimensions of the video, and artist and album of music files extracted from a CD.
pt_br: Os plug-ins do <application>Nautilus</application> podem estender a funcionalidade do gerenciador de arquivos de vários modos. Plug-ins podem adicionar informações suplementares para os diálogos de propriedade do arquivo, oferecendo ao usuários tudo o que eles precisam saber sobre os arquivos. Como exemplo o GNOME vem junto com um plug-in para exibir informações adicionais sobre arquivos de áudio e vídeo, assim como o codec utilizado, as dimensões do vídeo e artista e álbum de arquivos de música extraído de um CD.

source: Plugins can also add columns to the list view and automatically place emblems on files. This can be used to provide pertinent information to the user at a glance. For example, a <application>Nautilus</application> plugin could provide version control information on folders checked out from a version control system. Users could see directly in the file manager if a file is up to date, or if changes have been made locally.
pt_br: Os plug-ins podem adicionar colunas à visualização em lista e automaticamente dispôr emblemas nos arquivos. Isto pode ser utilizado para fornecer informações pertinentes ao usuário de relance. Por exemplo, um plug-in do <application>Nautilus</application> poderia fornecer informações sobre controle de versão em pastas verificado por um sistema de controle de versão. Os usuários poderiam ver diretamente no gerenciador de arquivos se um arquivo está atualizado ou se alterações foram feitas localmente.

source: <application>Nautilus</application> also allows developers to add items to the context menu for files and folders. Context menu items can specify for which types of files they should be displayed, so the context menu only provides actions that are relevant for the selected files. For example, <application>File Roller</application>, GNOME's archive file utility, adds an item to the context menu to extract archive files directly. Extra context menu items provide easy access to common operations on different types of files.
pt_br: O <application>Nautilus</application> também permite que os desenvolvedores adicionem itens ao menu de contexto para os arquivos e pastas. Os itens do menu de contexto podem especificar por quais tipos de arquivos eles devem ser exibidos, portanto o menu de contexto oferece ações que são relevantes apenas para os arquivos selecionados. Por exemplo, o utilitário de compactação de arquivos do GNOME, o <application>Gerenciador de pacotes</application>, adiciona um item ao menu de contexto para extrair arquivos compactados diretamente. Os itens adicionais do menu de contexto oferecem acesso facilitado às operações comuns em diferentes tipos de arquivos.
